package com.tapacross.sns.crawler.daum.cafe.util;

import java.util.ArrayList;

public class APIUtil {



	public static ArrayList<String> getApiUrl(){
		ArrayList<String> apiUrls = new ArrayList<String>();
		String[] apiAddress = {
				"http://openapi.naver.com/search?key=4d87f62e85dc4513248748cf511967ab&query=nexearch&target=rank"
				,"http://openapi.naver.com/search?key=4d87f62e85dc4513248748cf511967ab&query=movie&target=ranktheme"
				,"http://openapi.naver.com/search?key=4d87f62e85dc4513248748cf511967ab&query=people&target=ranktheme"
				,"http://openapi.naver.com/search?key=4d87f62e85dc4513248748cf511967ab&query=foreignactor&target=ranktheme"
				,"http://openapi.naver.com/search?key=4d87f62e85dc4513248748cf511967ab&query=perform&target=ranktheme"
				,"http://openapi.naver.com/search?key=4d87f62e85dc4513248748cf511967ab&query=drama&target=ranktheme"
				,"http://openapi.naver.com/search?key=4d87f62e85dc4513248748cf511967ab&query=broadcast&target=ranktheme"
				,"http://openapi.naver.com/search?key=4d87f62e85dc4513248748cf511967ab&query=book&target=ranktheme"						
		};
		
		for(String url : apiAddress){
			apiUrls.add(url);
		}
		return apiUrls;
	}
	
	
	public static ArrayList<String> getCafeApiUrl(){
		ArrayList<String> apiUrls = new ArrayList<String>();
		String[] apiAddress = {
				"http://openapi.naver.com/search?key=4d87f62e85dc4513248748cf511967ab&query=nexearch&target=rank"
				,"http://openapi.naver.com/search?key=4d87f62e85dc4513248748cf511967ab&query=movie&target=ranktheme"					
		};
		
		for(String url : apiAddress){
			apiUrls.add(url);
		}
		return apiUrls;
	}
	
	
	public static ArrayList<String> getKeyword(){
		ArrayList<String> keywordList = new ArrayList<String>();
		String[] keywords = {
				//삼성전자
				"힐스코메디칼"
		};
		for(String keyword : keywords){
			keywordList.add( keyword );
		}
		return keywordList;
	}
	
	
	public static ArrayList<String> getKeyword(String consumer){
		ArrayList<String> keywordList = new ArrayList<String>();
		
		if("1".equalsIgnoreCase(consumer)){
			String[] keywords  = {
					//주요 산업군 키워드(산업)
					"야구","통신","커피","주식","증권","카드","은행","화장품","백화점","아웃도어","가전","정기","적금","예금"
					,"전자","패션","전문점","광고","스포츠","드라마","연예","뉴스"
					
					//삼성전자
					,"찌질이","a/s"
					,"삼성","갤럭시","갤스","갤탭","갤럭시","갤노","GALAXY","아이폰","iphone","ipad","아이패드","삼성반도체"
					,"samsung반도체","삼성반도체산재","s전자 반도체 산재","삼성전자","samsung","s전자","산재","나꼽살"				
					
					//신한금융지주
					,"스마트금융","스마트뱅킹","스마트브랜치","신한S뱅크","금융스마트앱","신한금융지주","신한생명","신한투자","신한은행"
					,"신한금융투자","신한지주","신한금융","S뱅크","S은행","ShinhanBank","Shinhan은행","Shinhan지주","Shinhan금융","Shinhan","KB금융","KB금융지주","우리금융","우리금융지주"
					
					//신한카드 
					,"신한카드 아름인","신한카드 자동차금융","BC카드","KB카드","삼성카드","신한카드러브스토리","신한카드 홈쇼핑행사정보","신한레이디카드","올댓쇼핑","올댓여행","우리카드"
					,"신한카드 신상품체험단","신한카드","올댓","allthat","신한card","shinhancard","LG카드","엘지카드","이재우","Lgcard","NH카드","롯데카드","하나SK카드","현대카드"
					
					//교보문고
					,"교보문고","kyobobook","아이리버 스토리 K","Iriver Story K","인터파크","interparkbook","허정도"
					
					//폭스바겐
					,"폭스바겐","폭바","폴크스바겐","volkswagen","POLO","폴로","골프","GOLF","THEBEETLE","더비틀","골프쥐티아이","GOLFGTI","골프쥐티디","GOLFGTD"
					,"시로코","씨로코","SCIROCCO","제타","JETTA","파삿","파사트","PASSAT","CC","씨씨","페이튼","패이튼","PHAETON","골프까브리올레","GOLFCABRIOLET"
					,"티관","티구안","TIGUAN","투아렉","Touareg","벨로스터","아우디","제네시스","폭스바갠","혼다","audi","honda","폴크스바갠","Veloster","메트로 모터스"
					,"매트로 모터스","metro motors","영안모자","youngan"
					
					//BMW
					,"BMW","비엠더블유","비엠떠블유","비엠따블유","비엠떠불유","비엠따불유","베엠베","1시리즈 5도어 ","1시리즈 해치백 ","1시리즈 5도어 M스포츠 에디션 ","1시리즈","120d"
					,"3시리즈","320d EfficientDynamics","320i","320d","320d xDrive","328i","325d","X1","18d xDrive","20d xDrive","25d xDrive","3시리즈 투어링"
					,"320d","GT 320d","GT 320d xDrive","i3","X3","X3 20d","X3 28i","X3 30d","X3 35d","4시리즈 그란쿠페","420d","420i","435i","420d xDrive"
					,"5시리즈 투어링","520d","525d xDrive","4시리즈 컨버터블","428i","2014 그란투리스모","GT 550i xDrive","GT 이피션트다이내믹스","GT 530d","GT 530d xDrive"
					,"GT 535i xDrive","3시리즈 컨버터블","328i","335i","Z4","Z4 sDrive28i","Z4 sDrive35i","Z4 sDrive35is","액티브하이브리드 3","X5","xDrive 50i"
					,"xDrive 30d","xDrive 40d M스포츠 에디션","M 50d","X6","xDrive30d","xDrive35i","xDrive40d","xDrive50i","M50d","액티브하이브리드 5","2012 BMW M3"
					,"6시리즈 그란쿠페","640i","640d","2014 BMW M4 ","2013 BMW M3 컨버터블","2014 BMW M3","6시리즈 컨버터블","640i","650i","7시리즈","730d","740d","740i"
					,"740d xDrive","730Ld","740Li","750Li","750Li xDrive","760Li","액티브하이브리드 7시리즈","2014 M5","2013 X6 M","2013 M6 쿠페","2014 M6 그란쿠페"
					,"삼이공디","오이공디","엑삼","엠파이브","삼시리즈","오시리즈","칠시리즈","X시리즈"
					
					//아우디
					,"아우디","AUDI","A3","A4","S4","A6","S6","A8","A8L","A8LW12","S8","A5coupe","A5쿠페","S5coupe","S5쿠페","RS5coupe","RS5쿠페","알에스5"
					,"R8coupe","R8쿠페","R8spyder","R8스파이더","알팔스파이더","Q3","큐3","큐삼","Q5","큐5","큐오","큐파이브","큐빠","Q7","큐7","큐칠","큐세븐","A5sportback"
					,"A5스포츠","A5스포트","A7sportback","A7스포트","A7스포츠","A755TDI","A7TDI","S7sportback","에스7스포츠","에스7스포트","S칠스포츠","RS7","알에스칠","RS7sport"
					,"A5cabriolet","아우디까브리올레","아우디카브리올레","S4리무진","S4limousine","에스4리무진","S4","에스포","A시리즈","S시리즈","Q시리즈","R시리즈"
					
					//벤츠
					,"벤츠","Benz","벤쯔","메르세데스","Mercedes","메르쎄데스","A200 CDI","A200 CDI style","A200 CDI night","B200 CDI","C200","C200 AV","C220 BlueTEC AV"
					,"C220 BlueTEC EX","C220 CDI Coupe","E200","E220 CDI AV","E250 CDI 4MATIC AV","E300 EL","E300 AV","E300 4MATIC AV","E350 4MATIC AV","E200 Coupe"
					,"E350 Coupe","E200 Cabriolet","E350 Cabriolet","S350 BlueTEC ","S350 BlueTEC Long","S350 BlueTEC Long","S500 Long","S500 Long Edition1"
					,"S500 4MATIC Long","ML350 BlueTEC 4MATIC","G350 BlueTEC","CLA 200 CDI","CLS250 CDI Shooting Brake","CLS250 CDI Coupe ","CLS350 Coupe"
					,"GLK220 CDI 4MATIC","GLK220 CDI 4MATIC Premium","SLK200","SLK350","C63 AMG Edition 507","C63 AMG Coupe","E63 AMG 4MATIC","S63 AMG 4MATIC Long"
					,"CLA45 AMG 4MATIC","CLS63 AMG 4MATIC","CLS63 AMG S 4MATIC","CL63 AMG","ML63 AMG","G63 AMG","SL63 AMG","SLK55 AMG","SLS AMG","SLS AMG Carbon Package"
					,"SLS AMG Roadster","A클래스","에이클래스","B클래스","비클래스","C클래스","씨클래스","S클래스","에스클래스","E클래스","GT클래스","M시리즈"
					
					//기타
					,"사륜구동","엔진","하이브리드","연비","출력","마력","옵션","제원","4기통","6단수동기어","듀얼클러치자동변속기","휠","차체강성","전륜브레이크","배기음","후륜구동","서스펜션","바디킷"
					,"배기량","바이터보","헤드레스트","토크","뻥연비"
					
					//삼성화재
					,"동부프로미","마이애니카","삼성생명","삼성슈퍼보험","삼성화재","삼성화재 다이렉트","삼성화재 애니카웹진","삼성화제","애니카","애니홈","에니카","에니홈","anycar"
					,"anyhome","LIG 손해보험","myanycar","S화재","Samsung fire","Samsung life","동부화재","Dongbu fire","현대해상","Hyundai fire"
					,"개인정보"
					
					//IBK기업은행
					,"기업은행","IBK","IBK기업은행","IBK기업은행 PB브랜드","민병덕","아이비케이","기업bank","한동우","KB은행","국민은행","케이비은행","우리은행","신한은행 나라사랑카드"
					,"신한은행","하나은행"
					
					//AK MALL
					,"AK 양성욱 주임","AKMAll","에이케이몰","AK몰","디앤샵","GSSHOP","H몰","롯데닷컴","CJ몰","애경","앙크미","롯데I몰","롯데아이몰","GS샵"
					
					//AK PLAZA
					,"ak플라자","ak프라자","ak백화점","애경백화점","AKPLAZA","에이케이플라자","에이케이프라자","삼성플라자","삼성프라자"
					,"삼플","AK플라자백화점","AKPLAZA백화점","구로ak","분당ak","서현ak","수원ak","평택ak","원주ak","수원애경","구로애경","분당애경"
					,"원주애경","평택애경","주부블로거","PAM","서포터즈","대외활동","Mrs.AK","팸","대학생서포터즈"
					
					//신세계
					,"롯데백화점","롯데백화점 이벤트","서광준","서진원","쉰세계","신세계","신세계 강남","신세계 경기","신세계 광주","신세계 마산","신세계 본점","신세계 센텀시티","신세계 영등포"
					,"신세계 인천","신세계 충청","신세계몰","신세계百","신세계백화점","정용진","조준희","지대섭","헌세계","shinsegye","shinsegyemall","신세계 의정부","현대백화점","현대백화점 부산점"
					
					//성형
					,"분당서울대병원","분당서울대학교병원","분당서울대"
					
					//n now
					,"영월","신안","봉화"
					
					//정치
					,"박근혜","문재인","안철수","대선","후보","선거" 
					
					//2014-04-28 안예나 전임 요청으로 추가 
					,"정몽준", "박원순" 
					
					//제일기획
					,"제일기획"
					
					//지상파
					,"SBS","KBS","MBC","케이비에스","에스비에스","엠비씨","시청자 게시판","후기","촬영현장","영상","감독","작가"
					,"예능"
					//SBS 계열사
					,"SBS GOLF","SBS ESPN","EPL","로드 투 평창","베이스볼S","풋볼메거진골","this is basketball","디스 이즈 바스켓볼"
					,"SBS ESPN","잉글리시 프리미어리그","EPL","로드 투 평창","베이스볼S","풋볼메거진골","this is basketball","디스 이즈 바스켓볼"
					,"SBS Plus","풀하우스","SBS E!","서인영의 스타뷰티쇼","KSTARNEWS","TV 컬투쇼","오마이갓 2","SBS콘텐츠허브"
					//SBS 교양
					,"교양","동화 속 과학탐험","백세 건강스페셜","생활의 달인","문화가중계","현장 21","네트워크 현장 고향이 보인다","세상에서 가장 아름다운 여행"
					,"짝","안녕?자두야!","스캔2고","순간 포착 세상에 이런 일이","SBS 컬처클럽","내마음의 크레파스","꾸러기 탐구생활","생방송 투데이","SBS 시사토론"
					,"물은 생명이다","열린TV 시청자 세상","SBS 애니갤러리","궁금한 이야기 Y","우리 아이가 달라졌어요","모닝 와이드","SBS 생활 경제","그것이 알고 싶다"
					,"잘먹고 잘사는 법","토요특집 모닝와이드","생방송 브라보 나눔로또","TV 동물농장","최후의 제국","SBS 스페셜","특집다큐멘터리","희망 TV SBS"
					//SBS 드라마
					,"드라마","drama","드라마의 제왕","대풍수","그래도 당신","너라서 좋아","가족의 탄생","다섯 손가락","내사랑 나비부인","청담동 엘리스"
					,"야왕","그 겨울 바람이 분다","당신의 여자"
					//SBS 예능
					,"힐링캠프","강심장","한밤의 TV연예","정글의 법칙 W","박상면의 전파왕","고쇼","Go Show","SBS 지식나눔콘서트 아이러브인","접속 무비월드","스타주니어 붕어빵","개그투나잇","놀라운 대회 스타킹","런닝맨","도전 1000곡","SBS 인기가요","K팝 스타"
					,"화신","자기야","스타킹"
					//SBS 라디오
					,"라디오","radio","power107.7","파워 107.7","파워fm","love fm 103.5","러브에프엠 103.5","러프에프앰 103.5","최화정의 파워타임","김창렬의 올드스쿨"
					,"붐의 영스트리트","공형진의 씨네타운","두시탈출 컬투쇼","김민지의 행복한아침","김영철의 펀펀투데이","아름다운 이 아침 김창완","박소현의 러브게임"
					,"장기하의 대단한 라디오","정선희의 오늘 같은 밤","김형준의 뮤직하이","유혜영의 사운드오브뮤직","유영미 마음은언제나청춘","서두원의 시사초점","김소원의 SBS 전망대"
					,"정철진의 스마트경제","김지선 김일중의 세상을 만나자","라디오오디션 국민DJ를 찾습니다","노사연 이성미쇼","희망사항 변진섭입니다.","유영재의 가요쇼"
					,"박영진 박지선의 명랑특급","여러분의 국민DJ 이예랑입니다","최백호의 낭만시대","김태욱의 기분좋은 밤","이현경의 뮤직토피아","김정일의 생생가요","GO KOREA"
					,"배우 낭독 콘서트 신경숙을 읽다","박준형의 시사갈갈","특별기획 스타특강","2시의 뮤직쇼 김기덕입니다","유쾌한 주말 장두석입니다","행복한 주말 박해미입니다."
					,"사랑으로 하나되는 세상","정석문의 섹션라디오","브라보투데이","최혜림의 책하고 놀자","DJ처리 함께 아자아자"
					//SBS 관련 인물
					,"김명민","정려원","신은경","김승수","채시라","주지훈","지창욱","염정아","박용우","이경규","김제동","한혜진","강호동","윤도현","수영","김용만","김원희"
					,"박상면","김국진","신동엽","이동욱","유재석","이휘재","장윤정","아이유","이종석","양현석","박진영","조혜련","정주리","고현정","조형기","붐","은혁"
					,"양세형","조영구","윤종신","정형돈","김영철","지석진","김종국","하하","개리","이광수","송지효"

					//KBS 예능/드라마/다큐
					,"추적 60분","취재파일 4321","광고천재 이태백","아이리스2","삼생이","일말의 순정","힘내요 미스터김","내 딸 서영이","대왕의 꿈","안녕하세요","달빛 프린스","해피투게더 3","내생에 마지막오디션","불후의 명곡","두드림","남자의자격","1박2일","뮤직뱅크"
					
					//MBC 예능/드라마/다큐
					,"시사매거진 2580","PD 수첩","마의","7급 공무원","사랑했나봐","오자룡이 간다","아들 녀석들","백년의 유산","토크클럽 배우들","라디오스타","무릎팍도사","위대한 탄생","무한도전","아빠! 어디가?","매직콘서트","음악중심"
					
					//전산마비
					,"전산망 마비","서버마비","서버다운","사이버테러"
					
					//제일기획 요청
					,"에버랜드","로스트밸리","놀이공원","everland","롯데월드","lotteworld","뽀로로파크"

					//에잇세컨즈
					,"에잇세컨즈","에잇세컨스","에잇세컨드","8세컨즈","8세컨스","8세컨드","8seconds","eightseconds","8ightseconds","8 seconds","eight seconds","8ight seconds"
					
					//유니클로
					,"유니클로","유니끌로","유니크로","유니클로","uniqlo"
					
					//H&M
					,"H&M","H&M","에이치앤엠","에치앤엠","에이치엔앰","에이치엔엠","에치엠","에치앰","애치엠","애치앰","에첸엠","흐앰므","흐앤므","흐엠므","흐엔므"
					
					//자라
					,"zara","자라"
					
					//제일모직
					,"엠비오","앰비오","mvio","티앤지티","티엔지티","티엔쥐티","티앤쥐티","tngt","지오지아","ziozia","마에스트로","마애스트로","maestro","질스튜어트뉴욕","질슈트어트","jill stuart","빈폴"
					,"beanpole","닥스","daks","헤지스","해지스","hazzys","라코스테","라코스태","라코스텍","라코스택","lacoste","남성정장","정장","캐주얼","캐쥬얼","spa","스파브랜드"
					
					//현대자동차
					,"현대자동차","현대차","현대기아자동차","현대기아차","현기차"
					
					//제품
					,"가디건","다운점퍼","망토","바람막이","바막","아우터","자켓","잠바","쟈켓","저지","점퍼","조끼","짚업","청자켓","카디건","코트","파카","패딩","패팅","폴라폴리스","후리스","야상","재킷","집업"
					,"블루종","블레이저","트렌치","jacket","outer","jumper","vest","무스탕","긴팔","나시","남방","맨투맨","목티","목폴라","민소매","박스티","반팔","브이넥","블라우스","상의","셔츠","카라티"
					,"커플티","탱크탑","터틀넥","티","티셔츠","폴라티","후드","v넥","후디","후드티","탑","크롭탑","스웨터","니트","이너","top","남방","inner","면바지","바지","반바지","정장바지","청바지","치마"
					,"치마바지","하의","핫팬츠","스키니","쫄바지","핫펜츠","미니스커트","고무줄바지","고무줄치마","멜빵바지","스커트","팬츠","쇼츠","레깅스","슬랙스","데님","스키니","슬림핏","부츠컷","스트레이트","스커트"
					,"pants","jean","bottom","디트로이드진","씨위진","배기팬츠","원피스","점프수트","점수트","드레스","dress","jumpsuit","onepiece","키즈","Kids","키즈패션","가방","지갑","클러치","backpack"
					,"bag","clutch","pouch","totes","wallet","파우치","백팩","백","토트","크로스백","구두","단화","부츠","슈즈","스니커즈","신발","운동화","플랫","슬립온","슬리퍼","샌들","로퍼","스틸레토","shoes"
					,"옥스포드화","워커","웨지","컨버스","킬힐","워커","귀걸이","머리띠","이어링","목걸이","반지","밸트","벨트","선그라스","선글라스","썬그라스","썬글라스","액세서리","주얼리","쥬얼리","썬글","썬구리","네크리스"
					,"브라이슬릿","시계","액세서리","acc","accessory","sunglass","팔찌","스팽글","언더웨어","브라","팬티","속옷","잠옷","비키니","수영복","비치웨어","스윔수트","비치웨어","트레이닝","스윔쇼츠","bikini"
					,"swimsuit","beachwear","양말","벨트","타이","보타이","행거칩","행거치프","모자","장갑","스카프","서스팬더","서스펜더","모자","비니","스냅백","머플러"
					
					//이벤트
					,"콜라보","협업","콜라보레이션","플래그십","플래그쉽","팝업스토어","팝업","한정","리미티드","캠페인","핫아이템","패스트패션","인기아이템"
					//기타
					,"데일리룩","데일리코디","Dailylook","dailycodi","로피스룩"
					
					// 2014-06-20 배진영 전임, 김인경 선임 요청
					,"11st","11번가","십일번가","G9","지구인","G9인","지마켓","G마켓","쥐마켓","Gmarket","nsmall","nsshopping","NS몰","앤에스몰","앤에쓰몰","엔에스몰","엔에쓰몰","lotte mart","lottemart","롯대마트","shinsegaemall","ssgcom","옥션","auction","wemakeprice","위매프","위맵","위메이크프라이스","위메프","위멥","emart","e마트","임아트","interpark","인터팍","인터팍크","인팍","coupang","쿠팡","tmon","티몬","homeplus","홈플","스마일페이","스마일 페이","SmilePay","페이핀","PayPin","옐로페이","yelopay","비이커","BEAKER","패션피아","빈폴아웃도어"
					
					
					// 긴급
					,"KIA", "기아", "기아차", "기아자동차", "모닝", "올 뉴 모닝", "모닝 바이퓨얼", "기아 모닝", "프라이드", "프라이드 세단", "프라이드 해치백", "K3", "K3쿱", "K3 해치백", "K3 디젤", "K5", "더 뉴 K5", "K5 터보", "K5 하이브리드", "K7", "더 뉴K7", "프레스티지 K7", "K7 하이브리드", "K9", "프레스티지 K9", "레이", "기아 레이", "기아 레이 EV", "기아 레이 밴", "레이 밴", "레이 EV", "쏘울", "쏘울 GDI", "뉴 쏘울", "올 뉴 쏘울 ", "카렌스", "올 뉴 카렌스", "카렌스 LPG", "뉴 카렌스", "스포티지", "스포티지R", "뉴 스포티지R ", "쏘렌토", "쏘렌토R", "뉴 쏘렌토R ", "모하비", "카니발", "카니발R", "그랜드 카니발", "그랜드 카니발R", "카니발 하이리무진", "카니발 이지무브", "카니발  YP", "올 뉴 카니발"
					
					//2014-08/19 추가
					,"올리브영","Oliveyoung","왓슨스","Watsons","롭스","LOHBs","롯데리아","롯데랴","lotteria","롯대리아","롯리","로떼리아","로떼랴","노떼랴","노떼리아","맥날","맥도널드","맥도날드","마그도나르도","매그도나르도"
					,"Mcdonalds","버거킹","벌거킹","burgerking","케이에프씨","케이에푸씨","kfc","파파이스","파파이쓰","popeyes","TGI","TGIF","티지아이","나뚜루","natuur","던킨도너츠","던킨도넛","던킨","dunkin donuts"
					,"dunkin","미스터도너츠","미스터도넛","mister donut","베스킨 ","배스킨 ","Baskin Robinson","베라","베니건스","배니건스","bennigans","빕스","vips","스타벅스","스벅","starbucks","별다방","아웃백"
					,"outback","앗백","엔젤리너스","앤젤리너스","엔제리너스","angelinus","엔젤커피","엔젤인어스","카페베네","caffebene","카페베내","바귀베네","커피빈","콩다방","coffeebean","크리스피 ","krispy","탐앤탐스"
					,"탐탐","tomntoms","탐엔탐스","하겐다즈","하갠다즈","하겐더즈","haagendazs","할리스","hollys"
			};
			for(String keyword : keywords){
				keywordList.add( keyword );
			}
		} 

		if("2".equalsIgnoreCase(consumer)){
			String[] keywords  = {
					//632개 제일기획(기업)
					"KT","LG U+","SK동서식품","한국네슬레남양유업","매일유업롯데칠성음료","오뚜기","코카콜라","대항","해태음료","웅진","아름다운가게","제이앤푸드"
					,"BONAPARTE도담","시벳커피코리아","쟈뎅빙그래","태평양","구띠에커피","커피볶는집","비락","곰에스프레소","더세븐스","더츠 굿","띵크커피","로스팅플래닛"
					,"에스에이치네트웍스","빈스빈스","사과나무","스타벅스 코리아","오마르상사","와플반트","이디야","이엔지커피","카페베네","콜롬버스STC","탐엔탐스","파파로티"
					,"할리스F&B","CJ 푸드빌","Massimo Zanetti Beverage","OMA","커피프린스","할리스에프앤비","커핀그루나루","커피빈 코리아","띵크커피","다날엔터데인먼트"
					,"티에고","롯데리아","와플반트","다도글로벌","스티븐스","터틀마운틴코리아","킴스페스","현진푸드빌","자바시티 코리아파리크라상아피안코","SPC그룹 (비알코리아)"
					,"다빈치","글로리아진스 코리아","인터파크에이치엠","구스토커피커피","로티맘코리아","비알코리아","애니원푸드","비토코리아","황금나무커피","학산"
					,"성유엔터프라이즈","리에주코리아","커피와문화","로티보이베이크샵코리아","MPK그룹","버즈커피","세븐몽키스커피","스무디즈 코리아","삼우 SNG"
					,"울어바웃차","넥스트에프앤비","쥬노FNC ","카페7그램","동훈DOS ","컴온푸드서비스","코페아커피","핸즈커피","커피명가","롯데쇼핑 KKD산업본부"
					,"프라우스타 코리아","파파로티코리아","브라운하우스","푸라우스타 코리아","BOGO INC","데이트컴퍼니","띠아모코리아","ZOO COFFEE","커피스미스"
					,"Toms Coffee","퍼스트에이엔티","엘티디그룹","홈스테드","디자인파크","원앤원","엘라커피인터내셔날","커피 더 쏠","아이엔씨풀서비스","마시모"
					,"커피앤드에이","코코브로니","디앤드코리아","압구정볶는커피","커피코나","C&G글로벌","커피니","레몬테이블","주빈커피","디케이디자인그룹"
					,"제이콥에프앤비","에스앤큐","ChuEAT 츄잇","SN인더스트리","위메이크브랜드","앤하우스","더커피하우스","마사커피","씨앤비코리아"
					,"이랜드파크 외식사업부","와이비엠에듀케이션","엘레아","지나인","LOHAS COFFEE","신우트레비아","스위트번스 코리아","커피메모리","씨큐브커피"
					,"커피 허브나무","카페105","모모스커피","베이커리라리","커피토마토","카페빌","씨엔에스아이에이","보니떼","16번가","키브한커피","카페루카 코리아","아비시니카"
					,"비져스넷","와플마스터","커피세도나","커피파머스","금경에프앤비","도르체비타","채우다","커피지아","어바웃커피","도피오","네스프레소","말롱고","우리비㈜"
					,"루아흐커피","나이스코리아","에취알에스","HLI","커피와 사람","커피줄리스","두잉인터내쇼날","닥터만 커피","HLI KOREA","브로딩","라마즈로코","기센코리아"
					,"라니","아이앤에이","이멕스","레전드커피","칼리타","다이나믹통상","나이스코리아","기정인터내셔날","리우패밀리","우도상역","겔랑","고우내","글래머플래어즈"
					,"긴자토마토","네이처리퍼블릭","바이어스도르프","도브 코리아","동성제약","엘오케이","웅진코웨이미애부","베네피트","소망화장품시슬리","아모레퍼시픽","아미코스메틱"
					,"아이피카소브러쉬","엘리자베스아덴","옥시레킷벤키저","제닉","한국존슨앤드존슨세화피앤씨","코겐도","클라란스","프로랑스","비엠케이","LG생활건강더스킨하우스"
					,"더페이스샵","리오엘리","아이비스","원페이스","웰코스","BSK코퍼레이션","모로칸오일","Glamrock","렉스다이아몬드","베루체","보매 메르시에","아가타","아이핀"
					,"김찬월가모랩","폴리폴리","프랭크뮬러","에이블씨엔씨잇츠스킨","이엘씨에이한국GOWOONSESANG (고운세상)","ElishaCoy (엘리샤코이)","토니모리","고세코리아"
					,"KGC라이프앤진","쥴리크","록시땅코리아","SK-II","banila co.(바닐라코)","바이올렛드림","코리아나화장품한국오츠카제약","한국맨소래담","글로시박스코리아"
					,"러쉬코리아","디올","M&B SOLUTIONS","애경산업","무코타","스킨푸드","피엔제이","이넬화장품","㈜ 한스킨","씨앤피","메이크업포에버","한강인터트레이드MALU WILZ"
					,"엔프라니","㈜클리오","올레이","로트리","가네보 ","미에나","더샘인터내셔날","씨너지아이앤티","㈜커머스플래닛","한국화장품㈜한국암웨이㈜","한미인터내셔널㈜"
					,"에이본프로덕츠","디에이치씨코리아아이엔씨","라프레리코리아","WALA","유로카우프","㈜리빙네이처코리아","㈜오가닉 솔루션","ABALON","COVERGIRL","Kanebo"
					,"유한킴벌리","유니레버코리아","한불화장품","참존화장품","로리앙","비엔스텔라","웰라","제이앤씨화장품","한국천연물사이언스","랑카","다오린","젤코스아시아","위드스킨"
					,"종우실업","뷰티콜라겐","H&H Bion","리코리스","IGS","에코산업","실크리나","금상첨화","LUVIEW","힐스코메디칼","라미화장품","마크로케어","엘큐어","한빛코리아"
					,"아미화장품","제주사랑농수산","Bztoc Korea","Jayeonin ","스킨큐어","TeraEco","엠비스킨","Saeba","바이오뷰텍","바이오메틱스","뷰티메이처","Natural Works"
					,"카임화장품","닥터자르트","일조상사","퓨어코스","스와니코코","다요미","엠도씨","TEN NINE","라 쎌 LA CELL","CAN BIOTECH","스카이007","큐젠바이오텍","주신","튜링겐코리아"
					,"미시앙","다비드화장품","네슈라","기린화장품","KB코스메틱","디오프러스","네오팜","리오엘리","메드빌","SNP하장품","씨유스킨","아마란스 화장품","우신 화장품","에스테틱나인티나인"
					,"에제르","에버코스","케어쉴드","크로스메디텍","넥스메디카","조이코스","모네트","케일린 코리아","코엔자임 코리아","시크릿에이","웰바이코리아","바디야건강","나우코스"
					,"나투젠","코스메카코리아","화성화학","씨엔티드림","로얄그리인코리아","자연의벗","네오디엠","제이티","유스트코리아","노아코스메틱","라이프투게더","BODANA","로그사우전드"
					,"미인","원주코퍼레이션","더마힐씨엠에스","보미화장품","나드리화장품","네추럴티어스","누드코스메틱","네오젠 더마로지","두리화장품","디에스비코리아","뉴앤뉴"
					,"닥터마리","코스모스웨이","이노페이스","리즈케이","엠서클","데이셀","이아소","쟌퀼 ","에치앤지화장품","알앤엘내츄럴","L&P코스메틱바이오리","이트리얼","젠피아","코레존"
					,"후너스 바이오","수분아","셀라네츄럴코스메틱","한경희뷰티","송학","잎스코스메틱","애리조","에꼬르","내추럴타임","올가스토리","앤슬리","네이처프러스","자민경"
					,"코스비스코퍼레이션","티나인","쿠지인터네셔널","카오리온","프리비아 & 유코리아","NARS","안나수이","스프루스코리아","한국 시세이도","코스메데코르테","샹테카이코리아"
					,"플로라베이직","SEWHA P & C","듀어라이프","텔리헤어","아비노","백옥생화장품","헤어프랜드","이랜드제일모직H&M","인디텍스 그룹TOPSHOP","스파이시 칼라","에프알엘코리아"
					,"파파야코리아","망고 주식회사","신세계인터내셔날","LG패션트라이본즈","신성통상","S&A system","Leshop","포에버21리테이코리아","아이올리","코오롱인더스트리에스프리"
					,"SASCH","제이케이파트너즈","브이비에이","코데즈컴바인","좋은사람들","더베이직하우스","인디에프ANF코르텔피엘","아메리칸이글","이마트","River Island","ASOS","넥스트"
					,"시마무라","랩","에스핏","Primark","짐보리","한라시그마밸리","앤더블유피","Bershka","지오다노","Victoria's Secret","평안엘앤씨라코스테","밀레","벅스하우스"
					,"블랙야크","칸투칸","K2 코리아","골드윈코리아","몬츄라코리아","버그하우스","밀레","LS네트웍스","트렉스타","VAUDE","Deuter","컬럼비아스포츠웨어코리아","살레와"
					,"예솔스포츠넬슨스포츠","GOLDWIN KOREA","FILA금강제화화승알펜인터내셔널","MEH(밀레에델바이스홀딩스)","레드페이스","THEDOOR","FNC코오롱","셀파","에코로바"
					,"팀버라인아웃도어","인트로","살로몬코리아","호프힐","오스프리","스노우피크코리아","Gregory","영원무역","써미트","ABC마트 코리아","마이앙스","나이키아디다스리복"
					,"PUMA","반고인터내셔날","스프리스반스코리아","한국데상트","EXR KOREA","Kappa","테네비스","F&F","빌라봉","훼르자","웰빙아이엔씨","두루케이","에어워크","폭스코리아"
					,"Ecco㈜","ARENA SPORTS","SUGAPOINT ","한성에프아이","네오미오","데코","라라인터네이셔널","세정과미래","엠케이트렌드","엠케이트렌드","월비통상","지오나도","코넥스솔루션"
					,"피플트리","BasicNet S.p.A","Cheap Monday","Kangol Headwear","OFT컴퍼니","Paul Smith","RENEEVON","아비스타","버버리코리아","팬콧","구찌그룹코리아","돌체 앤 가바나"
					,"라바르카","마크모크","맨라이프","명실업","미스 셀프리지","버니블루","스타일요요 프로젝트","씨위데님","아베크롬비","에어웨어","자연나라","잔스포츠","제이브랜드"
					,"아비스타","한섬뱅뱅어패럴","행텐코리아","트루릴리젼","게스홀딩스코리아","베네통코리아YEJIN F&G (예진에프앤지)","비엠글로벌주식회사","Taylor Made","Cleveland Golf"
					,"Callaway Golf ","아큐시네트","덕화스포츠","블랙앤화이트 스포츠웨어","노이지노이지","슈페리어","보그너","캘러웨이 코리아","에스씨어패럴 코리아","강정윤골프","케이엔씨에프지"
					,"여미지 마코","데니스코리아","케이트로드","엘레강스","투비스 코리아","블루스톰","SPX코리아","메가피터스","발컴","하바이아나스","알콘스포츠코리아","JJ INTERNATIONAL"
					,"매드풋코리아","레디아이 코리아","버켄스탁","슈마커","지누스포츠","비안통상","크록스코리아 주식회사","에이비씨마트코리아","코넥스솔류션","이지스포츠","돔바코리아","B/D"
					,"BEARPAW","스노코코리아","키카","페프","크록스코리아㈜","HUNTER","DFD그룹","이에프씨","고세제화","무크","안토니세라제화","키사","아이투알","비경통상","바바라","지오앤사만사"
					,"심플로 필러 펜 컴퍼니","로만손","닉슨","델 인터네셔널","한성컴퓨터","LG전자","삼성전자","HP","Lenovo","아수스코리아","MSI","에이서","도시바","소니코리아","애플","TG삼보"
					,"큐브웨어","인텔","넥스트윈도우","엔스퍼트","한누리비즈","소리정보통신","택KT","Research In Motion(RIM)","MOTOROLA MOBILITY","Nokia","HTC 주식회사","삼성","LG","웅진"
					//1116개 제일기획(브랜드)
					,"olleh","인터넷 라이트","olleh tv 스카이라이프","olleh mobile","LG Uplus","SKTworld","SKTelecom","SK 브로드밴드","맥심","맥심 그랑누아","테이스터스초이스","수프리모"
					,"카푸치노","네스카페","그린블랜드","아이스빈","프렌치카페","카페라떼","바리스타 컵","아이스블랙","칸타타","UCC","조지아","로즈버드","나는오리지널","나는카페라떼","바바커피","아름다운커피"
					,"HRS","배전두커피","젠카페 헤이즐넛","티샘 헤이즐넛 티백원두커피","젠카페","모카골드","맥스타임","티샘","젠카페 아이스 커피믹스","Prestige","Miscela","Originale","Extrabar"
					,"Customizing","디카페인","제주감귤커피","시벳커피","쟈뎅","까페모리","까페리얼","아카페라","오설록","구띠에커피","커피볶는집","카페빌라지오","곰에스프레소","세븐스웨이브커피","더츠커피"
					,"띵크커피","로스팅 플래닛","베스트빈","빈스빈스커피","빈스빈스","커피베이","스타벅스","오마르커피","와플반트","이디야","카리부커피","카페베네","아르케 커피","탐앤탐스","파파로티","할리스커피"
					,"투썸플레이스","세가프레도","CafeOMA Korea","커피프린스","HOLLYS COFFEE","커핀그루나루","커피빈","달콤커피","커피마마","엔젤리너스","드롭탑","뉴욕핫도그앤커피","소딜리셔스"
					,"앤드류스 에그타르트 커피","요거프레소","자바씨티","자바시티","파스쿠찌","아피안코","던킨도너츠","다빈치","글로리아진스","디초콜릿커피","구스토커피","로티맘","미스터도넛","애니원푸드"
					,"슬립리스 시애틀의 잠못 이루는밤","이정기커피집","테라로사","성유엔터프라이즈","허니비","데일리브라운","로티보이","마노핀지카페","버즈커피","세븐몽키스","스무디킹","애니 앤 길벗"
					,"울어바웃차","찰리브라운카페","카페 네스카페","카페7그램","카페데베르","카페컴온","코페아커피","핸즈커피","커피명가","크리스피크림도넛","티퍼플","커피프라넬","프라우스타","하우스바위퀸"
					,"하우스브란트","카페띠아모","주커피","커피스미스","아리스타커피","바빈스","스타렉","홈스테드","미스터브리즈커피","커피에투온","엘라커피","커피 더 쏠","카페말로","마시모","커피앤드에이"
					,"코코브로니","디엔드","압구정볶는커피","커피코나","허니빈스","커피니","레몬테이블","주빈커피","커피스캔들","헬로키티카페","토프레소","ChuEAT 츄잇","쿠로다이","EAT커피","앤하우스"
					,"더커피하우스","마사커피","커피인뉴욕","더 카페","CNN 카페","엘레아커피","지나인","로하스","헨델과그레텔","스위트번스","커피메모리","씨큐브커피","커피나무허브나무","카페105","모모스커피"
					,"카페라리","커피토마토","카페빌","BC800 Coffee& Tea","보니떼","16번가커피","키브한커피","카페루카","아비시니카","셀프레소","와플마스터","커피세도나","커피파머스","모나티","채우다","커피지아"
					,"어바웃커피","도피오","네스프레소","말롱고","커피비","루아흐커피","Saeco","엑셀런스커피","카피테스","렉스로얄","산마르코","데이빗 스톤커피","빌레빌","세보 커피머신","커피줄리스","두잉인터내쇼날"
					,"닥터만 커피","에이치 엘 아이","브로딩","라마르조코","기센코리아","피티카페","블랙독","이멕스","레전드커피","칼리타","다이나믹통상","나이스코리아","기정인터내셔날","리우패밀리","우도상역","겔랑"
					,"고우내","글래머플래어즈","샥스핀콜라겐","네이처리퍼블릭","니베아","니베아포맨","도브 코리아","에이씨케어","로레알","슈에무라","비오템 옴므","키엘","랑콤 ","메이블린 뉴욕","비쉬","라로슈포제"
					,"REDKEN","KERASTASE","스킨수티컬즈","리엔케이 Re:NK","올빚","프롬","미애부","베네피트 코리아","다나한","에이디파잉","ESSOR","RGII","에코버블","꽃을든남자","시슬리 코리아","마몽드앤","헤라"
					,"설화수","아이오페","라네즈","마몽드","한율","리리코스","프리메라","이니스프리","에뛰드","에스쁘아","아모레퍼시픽","아리따움","해피바스","베리떼","롤리타렘피카","틴클리어","효시아","미래파"
					,"미장센","려","아모레뷰티카운티","BRTC","피카소브러쉬","엘리자베스아덴","Veet Korea","데톨","제닉","뉴트로지나","뉴트로지나맨","뉴트로지나","리체나","코겐도","CLARINS 클라란스","프로랑스"
					,"로라 메르시에","블리스","오휘","빌리프","LG생활건강","이자녹스 ","라끄베르","보닌","숨37","프로스틴","비욘드","더 후","수려한","큐레어","더스킨하우스","THEFACESHOP 더페이스샵","리오엘리"
					,"블루오렌지","원페이스","웰코스","The Body Shop Korea","모로칸 오일","글램락","렉스다이아몬드","베루체","보매 메르시에","아가타 코리아","가발모아","김찬월가모","폴리폴리","프랭크뮬러","뷰티넷","미샤"
					,"어퓨 화장품 ","잇츠스킨","FLIRT! Cosmetics","굿스킨","달팡 ","오리진스 코리아","랩 시리즈","바비 브라운","크리니크","에스티로더","오리진스","맥","라 메르","AVEDA (아베다)","고운세상","엘리샤코이"
					,"토니모리","코스메 데코르테","모이스처 스킨 리페어","설기정","청기정","프레디아","스파데그랑","아스탈루션","백등","윤기정 프라임","네이처앤코","파시오","동인비","랑","쥴리크","록시땅 코리아","SK-II"
					,"바닐라코","보브","라비다","자인","코리아나","피츠베이비","에스테텀","글램3","한방미인","텐세컨즈","세니떼","비취가인","코리아나비오데팡스","쉬니즈","노니상지","로코모션","녹두","우르오스","하다라보 "
					,"글로시박스","러쉬코리아","크리스챤 디올","콤비타","케라시스","에스따로","하나로","헤어.앤","포인트","에이솔루션","루나솔","에스테틱하우스","씨네이크","리얼 페이스","글램비","무코타","스킨푸드","박준뷰티랩"
					,"입큰 블로그","입큰 카페","한스킨","차앤박","메이크업 포에버","키스미","캔메이크","키스","비앤씨","케이팔레트","페어리드롭","사벡스","베이직케어","마루빌츠","엔프라니","클리오","페리페라 ","Olay"
					,"로트리","케이트","임프레스","브란실 슈페리어","코후레도르","글램디아","더샘","홀리카홀리카","싸이닉","롤린느","CALLI","FLANNCHE","TEMPTATION","쥬단학","효움","OSSION","IDEM","EKANAVA","CROQUI"
					,"CONTINUEHM","예화선","XIAN","뷰트리","OTHERS","ARTISTRY","아티스티리 맨","Burt's Bees","에이본","DHC","로고나","닥터 하우쉬카","안네마리보린","리빙네이쳐","캐롤프리스트","아바론","커버걸"
					,"카네보","티엔","그린핑거","유니레버코리아","폰즈","바세린","럭스","잇츠레이디","로하시스","참인셀","레드와인","디에이지","CCS","뉴콘","스킨타운","플레지엄","메디셀","지안","보화선","랑클리어","징코"
					,"참존엔씨원","희부탄","알바트로스","탑스타일 어드밴스","탑클래스","탑뉸스 지이","휴브","라야","리파인","ETC","올랑","스틸라","샤넬","제이앤씨화장품","한국천연물사이언스","랑카","다오린","젤코스아시아"
					,"위드스킨","종우실업","뷰티콜라겐","H&H Bion","리코리스","IGS","에코산업","실크리나","금찌코스메틱","LUVIEW","힐스코메디칼","라미화장품","마크로케어","엘큐어","한빛코리아","아미화장품","송이화장품"
					,"Bztoc Korea","Jayeonin ","스킨큐어","TeraEco","엠비스킨","Saeba","바이오뷰텍","바이오메틱스","뷰티메이처","Natural Works","카임화장품","닥터자르트","아마르떼","퓨어코스","스와니코코","다요미"
					,"엠도씨","TEN NINE","라 쎌 LA CELL","CAN BIOTECH","스카이007","큐젠바이오텍","주신","튜링겐코리아","미시앙","다비드화장품","네슈라화장품","기린화장품","KB코스메틱","디오프러스","네오팜","메드빌"
					,"SNP하장품","씨유스킨","아마란스 화장품","우신 화장품","에스테틱나인티나인","에제르","에버코스","케어쉴드","크로스메디텍","넥스메디카","조이코스","모네트","케일린 코리아","코엔자임 코리아","시크릿에이"
					,"웰바이코리아","바디야건강","나우코스","나투젠","코스메카코리아","화성화학","씨엔티드림","로얄코스메틱스","자연의벗","네오디엠","제이티","스위스 유스트 코스메틱","노아코스메틱","라이프투게더","BODANA"
					,"로그사우전드","마이너스제로","원주코퍼레이션","더마힐씨엠에스","보미화장품","베르당","상황미인","청주","쟈레스","헤르본","루센느","위연","메르디엠","위시","레브론","시크리티스","보토링클","네추럴티어스"
					,"누드코스메틱","네오젠 더마로지","두리화장품","디에스비","닥터시스","닥터마리","더마썸","라포레","리즈케이","닥터스킨케어","데이셀 ","이아소","스킨러버스","도화랑","닥터쥬르크","메디힐","닥터포스킨"
					,"닥터포헤어","메디플랜","쉬즈애비뉴","뿌리깊은나무","바이오리","SKIN79","시크릿키","쉬즈유리스","스위스킨","수분아","셀라","한경희 뷰티","송학화장품","잎스","애리조","에꼬르","에코케어","오가니크","앤슬리"
					,"엔조이","자민경","제니스웰","커버퀸","쿠지화장품","카오리온","프리비아","NARS","안나수이","fresh","시세이도","코스메데코르테","샹테카이","H2O","SEWHA P & C","듀어라이프","텔리헤어","아비노","백옥생화장품"
					,"헤어프랜드","MIXXO 미쏘","미쏘시크릿 ","스파오","후아유","유솔","뉴발란스","엘레쎄","버그하우스","스포블릭","쉐인진즈","콕스","티니위니","라틀렉틱","레이디브렌","언더우드","스텝","투미","로엠","더데이"
					,"클라비스","테레지아","몬티니","데코","이엔씨","나인식스뉴욕","디아","아나카프리","포인포","오후","코코리따","치크","언더우드스쿨","리틀브렌","비아니키즈","이랜 주니어","헌트 키즈","로엠 걸즈","더데이걸즈"
					,"트리시","셀덴","로이드","클루","오에스티","에블린","헌트이너웨어","더데이 언더웨어","바디팝","오엑스","빅맨","제일모직","에잇세컨즈","엠비오","빈폴","일모스트릿","에피타프","갤럭시","로가디스","빨질레리"
					,"나나리치맨","띠어리 ","란스미어","구호","르베이지","데레쿠니","멜리사","아이덴티","이세이미야케","토니버치","발렉스트라","블리커","꼼데가르송","CARVEN","나인웨스트","이지스피릿","엔조안지올리니","스티브 매든"
					,"FUBU","H&M","자라  (ZARA)","마시모 두띠","버쉬카","유테르케","풀앤베어","스트라디바리우스","탑샵","스파이시칼라","유니클로","파파야코리아","망고","필립림","알렉산더","아르마니","엠포리오","바나나 리퍼블릭"
					,"크리스챤 루부땅","크롬하츠","코치","디젤","돌체가바나","드리스 반 노튼","디스퀘어드","GAP","제이 린드버그","매종 마틴 마르지엘라","마르니","몽클레르","뿌띠 바또","센죤","스텔라 맥카트니","어그 오스트레일리아"
					,"요지 야마모토","보브","지컷","톰보이","디자인유나이티드","해지스","닥스","TNGT","라푸마","타운젠트","마에스트로","MOGG","레오나드","ISABEL MARANT","조셉","바네사브루노","질바이질스튜어트","JILL STUART"
					,"HUNTER","인터스포츠","막스마라","닐바렛","빈스","버튼","블루마린","제덴","찰스앤키스","PLGRIM","탑텐10","지오지아","올젠","유니온베이","메이폴","르샵","포에버 21","플라스틱아일랜드","코오롱 스포츠","ELORD"
					,"HEAD","Jacknicklaus","커스텀멜로우","쿠아","캠브리지멤버스","클럽캠브리지","지오투","더 슈트하우스","브렌우드","스파소","아르페지오","쿠아","sandro","헨리코튼","Series","COURONNE","GEOX","마크 제이콥스"
					,"JIMMY CHOO","Berluti","John varatos","CoSTUME NATIONAL","에스프리","싸쉬","우먼시크릿","밸리걸","코데즈컴바인","퍼스트올로","보디가드","예스","섹시쿠키","제임스딘","돈앤돈스","보니앤크라이드","스페셜라인"
					,"베이직하우스","인디에프","조이너스","꼼빠니아","예츠","예스비","트루젠","테이트","프레디","보르보네제","아베크롬비","홀리스터","길리힉스","코르텔피엘","아메리칸이글","데이즈","리버아일랜드  ","아소스 ","넥스트 "
					,"시마무라","LAP","에스핏","Primark","짐보리","컬쳐콜","스마일마켓","버시카","빅토리아 시크릿","네파","PAT","ELLE COLF","라코스테","밀레","벅스하우스","블랙야크","칸투칸","K2","아이더","노스페이스","몬츄라","몽벨"
					,"잭울프스킨","프로스펙스W","스케쳐스","WALK&TALK","트렉스타","바우데","도이터 (Deuter)","마운틴하드웨어","컬럼비아","살레와","쉐펠","이글크릭","HIGH8848","아크테릭스","에이글","휠라 스포트","FILA","바이오소프","Buffalo"
					,"BRUNOMAGLI","CAT","Clarks","Callaghan","Esprendor","Freebelle for jumior","Haruta","헬리한센","Heritage Regal","Kimloch Anderson","Landmaster","랜드로바","Landrover for toddlers","머렐","르까프"
					,"케이스위스","피엘라벤 칸켄","나파피리","레드페이스","더도어","코오롱 액티브","셀파","에코로바","팀버라인아웃도어","마운틴이큅먼트","살로몬코리아","호프힐","오스프리","스노우피크","그레고리","영원","써미트"
					,"ABC마트","마이앙스 korea","나이키","아디다스","리복","푸마코리아","컨버스","스프리스","PONY","EVERLAST","IPANEMA","RIDER","SPRI STAR","반스","르꼬끄","데상트","먼싱웨어","GOLF","Calvin Klein golf","EXR"
					,"Kappa","테네비스","MLB Korea","빌라봉 ","훼르자","세븐다이얼","레노마 스포츠","레노마 골프","에어워크","닉스아이","에코코리아","아레나","슈가포인트","올포유","케즈","그라피티","NII","TBJ","버커루진","에비수"
					,"BSX","탐스 슈즈","피플트리","수페르가","칩먼데이","캉골코리아","아웃피터스","폴 스미스 코리아","레니본","카이야크만","에린브리니에","버버리","팬콧","구찌 코리아","돌체 앤 가바나","라바르카","마크모크","맨라이프 & 엠시리즈"
					,"니콜생질르","몽삭","미스 셀프리지","버니블루","스타일요요","씨위","아베크롬비","닥터마틴","자연나라","잔스포츠","제이 브랜드","TIME","TIME HOMME","MINE","SYSTEM","SJSJ","SEE BY CHLOE","LANVN","BALENCIAGA"
					,"JUICY COUTURE","ORLA KIELY","ANN DEMEULEMEESTER","MUE","TOM GREYHOUND DOWNSTAIRS","LANVIN COLLECTION","MUE GALLERY","뱅뱅","행텐","H&T","트루릴리젼","GUESS (게스)","베네통코리아","니나리찌","더블엠"
					,"라비엔코","울시","테일러메이드 코리아","클리브랜드골프","켈리웨이골프 코리아","풋조이","미즈노","블랙앤화이트","노이지노이지","슈페리어 골프","임페리얼","프랑코페라","ROBERTA DI CAMERINO","윌리엄스버그"
					,"블랙 마틴싯봉","Martine SITBON","K.J. CHOI GOLF & SPORTS","보그너","한국캘러웨이","벤호건 골프","JACUA","강정윤골프","김영주골프","마코스포츠","데니스코리아","케이트로드","엘레강스 골프","블라도","4NF","SPX "
					,"플루트","쿠카몽가","하바이아나스","HALCON","플로조스","MADFOOT","레드아이","버켄스탁","슈마커","팝슈즈","데이아웃","크록스 코리아","ABC마트 ","saucony","돔바","루릭","베어파우","스노코","벤시몽","키카","페프"
					,"HUNTER","소다","에스콰이어","고세","무크","안토니","바이네르","키노피오","세라","키사","탠디","미소페","바바라","지오앤사만사","보메 메르시에","제이에스티나","로만손","닉슨 ","DELL SALES","한성컴퓨터"
					,"엑스노트 미니 아이스크림","엑스노트","LG Optimus PAD LTE","LG Optimus LTE","애니콜","Samsung Mobile","삼성 노트북","갤럭시","HP KOREA _ PSG","엔비스펙터XT","옴니27올인원","Pavilion dv6","EliteBook"
					,"레노버 코리아","ASUS Korea","MSI","에이서","도시바","소니 엑스페리아 공식 페이스북","소니코리아","애플","한국 아이폰","애플 맥북에어","애플 맥북프로","아이패드","TG삼보","큐브웨어","인텔 코리아","넥스트윈도우"
					,"아이덴티티탭","누리안","소리정보통신","SKY","팬택","스카이 베가","KT 스마트폰","블랙베리","모토로라","노키아","HTC Korea","SMART TV 파브","삼성전자","LG전자","웅진코웨이"
					
					//2014-06-10 추가
					,"AMOREPACIFIC","HERA","SULWHASOO","IOPE","LANEIGE","MAMONDE","HANYUL","LIRIKOS","PRIMERA","INISFREE","ETUDE","ESPOIR","TEENCLEAR","VERITE","sk2화장품","화장품후","ESTEE LAUDER"
					,"OHUI","kiehls","BOBBIEBROWN","SHUEMURA","DIOR","클리니크","clarins","biotherm","메이컵포에버","missha","the face shop","네이쳐리퍼블릭","TONYMOLY","LANCOME","CHANEL","loreal","MAC"
					,"BENEFIT","MAYBELLINE","NYX","CLIO","HOLIKA","YVESSAINTLAURENT","ISOI","ITSSKIN","ISAKNOX","SU-M37","LOTREE","GUERLAIN","SOORYEHAN","DANAHAN","CATHYCAT","VOV","HAANBEAUTY"
					,"LACVERT","BEYOND","혜라화장품","SULHWASOO","LANEGE","LILIKOS","INNISFREE","sk2에센스","더히스토리후","clinique","MAKEUPFOREVER","NATUREREPUBLIC","SUM","HANBEAUTY","설화슈","에스케이투"
					,"더히스토리오브후","자연공화국","SK2","더후","바비브라운","클리니크","맥","닉스","입생로랑","아이소이","캐시캣","VOV","한경희"
			
					// 긴급
					,"KIA", "기아", "기아차", "기아자동차", "모닝", "올 뉴 모닝", "모닝 바이퓨얼", "기아 모닝", "프라이드", "프라이드 세단", "프라이드 해치백", "K3", "K3쿱", "K3 해치백", "K3 디젤", "K5", "더 뉴 K5", "K5 터보", "K5 하이브리드", "K7", "더 뉴K7", "프레스티지 K7", "K7 하이브리드", "K9", "프레스티지 K9", "레이", "기아 레이", "기아 레이 EV", "기아 레이 밴", "레이 밴", "레이 EV", "쏘울", "쏘울 GDI", "뉴 쏘울", "올 뉴 쏘울 ", "카렌스", "올 뉴 카렌스", "카렌스 LPG", "뉴 카렌스", "스포티지", "스포티지R", "뉴 스포티지R ", "쏘렌토", "쏘렌토R", "뉴 쏘렌토R ", "모하비", "카니발", "카니발R", "그랜드 카니발", "그랜드 카니발R", "카니발 하이리무진", "카니발 이지무브", "카니발  YP", "올 뉴 카니발"
			
					//2014-08/19 추가
					,"올리브영","Oliveyoung","왓슨스","Watsons","롭스","LOHBs","롯데리아","롯데랴","lotteria","롯대리아","롯리","로떼리아","로떼랴","노떼랴","노떼리아","맥날","맥도널드","맥도날드","마그도나르도","매그도나르도"
					,"Mcdonalds","버거킹","벌거킹","burgerking","케이에프씨","케이에푸씨","kfc","파파이스","파파이쓰","popeyes","TGI","TGIF","티지아이","나뚜루","natuur","던킨도너츠","던킨도넛","던킨","dunkin donuts"
					,"dunkin","미스터도너츠","미스터도넛","mister donut","베스킨 ","배스킨 ","Baskin Robinson","베라","베니건스","배니건스","bennigans","빕스","vips","스타벅스","스벅","starbucks","별다방","아웃백"
					,"outback","앗백","엔젤리너스","앤젤리너스","엔제리너스","angelinus","엔젤커피","엔젤인어스","카페베네","caffebene","카페베내","바귀베네","커피빈","콩다방","coffeebean","크리스피 ","krispy","탐앤탐스"
					,"탐탐","tomntoms","탐엔탐스","하겐다즈","하갠다즈","하겐더즈","haagendazs","할리스","hollys"
			};
			for(String keyword : keywords){
				keywordList.add( keyword );
			}
		} if("3".equalsIgnoreCase(consumer)){
			String[] keywords  = {
					"삼성전자","현대자동차","한국전력공사","엘지전자","삼성생명보험","에스케이","포스코","국민은행","지에스칼텍스","기아자동차","에스케이네트웍스"
					,"에쓰오일","케이티","교보생명보험","우리은행","대한생명보험","한국가스공사","현대중공업","에스케이텔레콤","삼성물산","엘지필립스엘시디"
					,"롯데쇼핑","현대오일뱅크","삼성화재해상보험","대한항공","현대모비스","지엠대우오토엔테크","엘지화학","신한은행","신세계","한국외환은행"
					,"중소기업은행","엘지상사","케이티프리텔","한진해운","하나은행","하이닉스반도체","한국씨티은행","삼성에스디아이","지에스건설"
					,"한국수력원자력","삼성중공업","대우인터내셔널","대우건설","현대제철","효성","현대상선","대우조선해양","현대건설","대림산업"
					,"포스코건설","현대해상화재보험","한국스탠다드","삼성테스코","에스케이인천정유","엘아이지손해보험","엘지텔레콤","쌍용자동차"
					,"동부화재해상보험","여천엔씨씨","동국제강","두산중공업","코리안리재보험","아시아나항공","롯데건설","노키아티엠씨","한국남부발전"
					,"두산인프라코어","삼성토탈","에스티엑스팬오션","엘지카드","엘에스니꼬동제련","핸대하이스코","아이앤지생명보험","제일모직"
					,"위아","에스케이건설","대우자동차판매","한국도로공사","엘에스전선","씨제이","삼성카드","동부제강","삼성테크윈","현대산업개발"
					,"지에스리테일","알리안츠생명보험","삼성광전자","한국중부발전","삼성전기","한국서부발전","한진중공업","케이티앤지"
					,"르노삼성자동차","한국동서발전","대우일렉트로닉스","한화","한화석유화확","호남석유화학","한국남동발전","한국바스프"
					,"에스케이가스","한국타이어","에스엘시디","동양생명보험","메리츠화재해상보험","엘지석유화학","하이마트","현대미포조선"
					,"현대삼호중공업","신한금융지","삼성에스디에스","케이씨씨","우리금융지","두산","흥국생명보험","현대캐피탈","신한생명보험"
					,"미래에셋생명보험","롯데대산유화","금호타이어","이원","두산산업개발","금호석유화학","삼성코닝정밀유리","팬택앤큐리텔"
					,"한국까르푸","만도","대림코퍼레이션","농심","대한전선","엘지씨엔에스","에스케이해운","유코카캐리어스","삼천리","글로비스"
					,"포스틸","금호산업","케이피케미칼","쌍용","하나로텔레콤","삼성석유화학","에스케이씨","금호생명보험","고려아연","동부건설"
					,"풍산","노벨리스코리아","부산은행","삼성에버랜드","호텔롯데","정리금융공사","다이모스","삼남석유화학","대구은행","현대종합상사"
					,"한화건설","태광산업","서울보증보험","로템","코오롱","한라공조","보광훼미리마트","태평양","대한통운","쌍용건설","유니온스틸"
					,"동부한농","에스티엑스조선","창원특수강","데이콤","한솔제지","동우화인켐","도시바삼성스토리지","롯데제과","대한해운"
					,"엘에스산전","동양제철화학","롯데칠성음료","에스케이케미칼","서울도시가스","텍사스인스트루먼트","코오롱건설","볼보건설기계코리아"
					,"대한유화공업","한국쓰리엠","대상","농협유통","제일화재해상보험","삼성엔지니어링","쌍용양회공업","엘지필립스디스플레이"
					,"히타치엘지데이터스토리지","웅진코웨이","세아베스틸","에스케이씨앤씨","범한종합물류","삼성증권","신동아화재해상보험","삼양사"
					,"푸르덴셜생명보험","오뚜기","엘지생활건강","한국델파이","세아제강","삼선로직스","풍림산업","엘지이노텍","희성전자","삼테크"
					,"서브원","리빙프라자","현대파워텍","한국야쿠르트","경남기업","쌍용화재해상보험","소니코리아","한국아이비엠","휴비스"
					,"메트라이프생명보험","동양종합금융증권","하이트맥","한라건설","대한제당","강원랜드","우리투자증권","한국소니전자","삼성전자로지텍"
					,"동서식품","대우증권","롯데상사","대교","대성산업","엠코","남양유업","경남은행","대양상선","인천국제공항공사","삼성정밀화학"
					,"필립스전자","아이마켓코리아","유한킴벌리","벽산건설","현대백화점","삼보컴퓨터","두산엔진","한화종합화학","고려개발","동국무역"
					,"엘지마이크론","새한","대한도시가스","한진","현대카드","진로","월마트코리아","에스티엑스엔진","남해화학","매일유업","예스코"
					,"이수화학","한신공영","한국항공우산업","계룡건설산업","이랜드월드","에스티엑스","삼부토건","문화방송","삼환기업","도레이새한"
					,"롯데햄롯데우유","팬택","폴리미래","월드건설","태영","광은행","동원에프앤비","파워콤","메가마트","한국노스케스코그","에스원"
					,"굿모닝신한증권","비앤지스틸","카프로","씨제이푸드시스템","휴맥스","삼성코닝","케이씨씨건설","롯데역사","우림건설","에스비에스"
					,"동문건설","오비맥","도비사일렉트로닉스","하이프라자","한국철강","한솔엘씨디","대한화재해상보험","신호제지","신성건설","이수건설"
					,"모토로라코리아","서린상사","아워홈","롯데알미늄","뉴코아","포항강판","엠코테크놀로지코리아","한국지역난방공사","농협사료","금호피앤비화학"
					,"페어차일드코리아반도체","신동아건설","동부생명보험","한전기공","제일기획","빙그레","웅진씽크빅","흥아해운","오리온","신도리코"
					,"동아제약","동양건설산업","대우정밀","지에스홈쇼핑","롯데카드","코오롱글로텍","세아상역","공문교육연구원","두산메카텍","세운철강"
					,"코스트코코리아","부산도시가스","한국프랜지공업","전자랜드","화성산업","삼성전자서비스","한국코카콜라보틀링","가온전선","엘지"
					,"동양시멘트","서원유통","케피코","브리티쉬아메리칸토바코","한일건설","한일시멘트","와이케이스틸","대건설","성신양회","고려해운"
					,"코리아세븐","희성엥겔하드","한국로버트보쉬기전","일진전기","현대오토넷","현대엘리베이터","현대증권","삼성네트웍스","현진"
					,"코리아니켈","신세계건설","남양건설","하나증권","현대택배","대원강업","비오이하이디스테크","오씨아이상사","비씨카드","동일석유"
					,"한진도시가스","비엠더블유코리아","경동도시가스","삼성탈레스","씨제이홈쇼핑","남광토건","화승알앤에이","그린화재해상보험"
					,"대한택보증","호텔신라","씨제이지엘에스","대덕테크노밸리","레인콤","코오롱유화","중앙건설","삼호","대구도시가스","신무림제지"
					,"지에스파워","일본전기초자한국","실트론","위니아만도","지에스홀딩스","녹십자생명보험","한국암웨이","넥스원퓨처","경신공업"
					,"한일이화","신한카드","애그리브랜드휴리나","럭키생명보험","교보자동차보험","영원무역","두원공조","영풍","부영","파리크라상"
					,"에스티엑스엔파코","신일","포스코파워","넥센타이어","케이티네트웍스","에스지위카스","바이더웨이","한미석유","유한양행","서진산업"
					,"한국미니스톱","조선일보사","한샘","대한펄프","삼표","진도","세방","고려제강","애경유화","일신건설산업","대우버스","태산엘시디"
					,"디에스엘시디","동일토건","한미약품","대성전기공업","대원컴퓨터","동남아해운","대한정판매","금강","극동건설","코오롱씨앤씨"
					,"반도건설","머크어드밴스드테크","현대아이티","대동종합건설","풀무원","포스콘","온세통신","하림","금광기업","백송종합건설"
					,"메르세데스벤츠코리아","백제약품","엔투비","현대에이치앤에스","신라철강","덴소풍성","씨텍","공항석유상사","동서석유화학"
					,"엔에이치엔","동부일렉트로닉스","세종공업","라파즈한라시멘트","에스케이텔레시스","에스에프에이","대동공업","진흥기업"
					,"롯데삼강","신영","한국디지털위성방송","씨멘스오토모티브","한국후지제록스","오토에버시스템즈","대신증권","대한투지증권"
					,"성철사","장금상선","현대정보기술","대한제강","대원사업","한세실업","신성통상","한무쇼핑","태광실업","한국포리올","녹십자"
					,"신원","신아","에프엔씨코오롱","대덕전자","중앙일보사","한국전기초자","한국제지","한국인삼공사","대창공업","인천도시가스"
					,"위디츠","현대시멘트","한국화낙","전북은행","휴스틸","델파이코리아","캐리어","케이엠앤아이","서울통신기술","지에스네오텍"
					,"포스테이타","발레오전장시스템스코리아","롯데기공","해태음료","세정","한국증권금융","엘지다우폴리카보네이트","크라운제과"
					,"에스엘","환영철강공업","한국니토옵티칼","대경","연테크","에스티엑스중공업","에이에스이코리아","중외제약","브이케이"
					,"한전케이디엔","한국투자증권","한국후지쯔","창신아이엔씨","에원이씨에스","대우캐피탈","조일알미늄","티센크루프동양엘리베이터"
					,"글락소스미스코리아","에이치케이","동양메이저","한국다우케미칼","케이이씨","한섬","인탑스","케이티에프테크놀러지","삼성비피화학"
					,"린나이코리아","재능교육","현진에버빌","한국토요타자동차","울트라건설","한국증권선물","에코플라스틱","성지건설","메티아"
					,"삼정피앤에이","우영","캄코","한국공항공사","나이키스포츠","동아일보사","충남도시가스","세방전지","성원건설","한화국토개발"
					,"경남에너지","조선내화","다스","엘지엔시스","리바트","화신","동방","한욱테크노글라스","현대에프앤지","한국유리공업","현대홈쇼핑"
					,"평화홀딩스","인터플렉스","한","대웅제약","신도종합건설","카스코","교원","대우엔지니어링","애경산업","동명스틸","에스앤티중공업"
					,"교보문고","건남개발","롯데미도파","동양기전","국도화학","휴켐스","디아지오코리아","삼양식품","임광토건","대상팜스코"
					,"쎄븐마운틴해운","지오영","한국피자헛","스테코","미래에셋증권","동원시스템즈","엠시트","한국전력기술","위스코","파라다이스"
					,"씨멘스브이디오한라","대덕지디에스","캐논코리아비즈니스솔루션","타이코에이엠피","라이나생명보험","엘지엠엠에이","대창철강"
					,"동양석판","워커힐","삼능건설","한국티티","태왕","서울석유","동국산업","한국공항","동양물산기업","네오스틸","택관리공단","킴스개발산업"
					,"세양선박","화승알앤에이","한국제강","희성금속","아세아시멘트","한국알프스","서희건설","우리금융정보시스템","삼동","이테크건설"
					,"경북광유","한화유통","아산업","삼양화성","세아특수강","원우정밀","한국화이자제약","쿠쿠홈시스","한솔섬유","동방금속공업","한국다우코닝"
					,"동일산업","한솔교육","한국산업가스","코슨","대택","송원산업","율촌화학","크레신","대원","로디아폴리아마이드","한국유에스씨전자","포스렉"
					,"동원산업","모토닉","대한화섬","코리아오토글라스","광신석유","제일약품","금강철강","일신방직","성우하이텍","신창전기","오뚜기라면"
					,"우리홈쇼핑","성원산업개발","동지쎄미켐","현대푸드시스템","한국네슬레","한솔건설","한화기계","피앤텔","한성자동차","교보증권"
					,"로옴코리아","해태제과식품","보성건설","대우정보시스템","엠비메탈","씨제이씨지브이","복산약품","타이거오일","우방","부국증권"
					,"쌍용정보통신","코리아원","디피아이","산은캐피탈","대한방직","종근당","이랜드","신세계푸드","바이엘코리아","현대아산","대림자동차공업"
					,"한독약품","무송종합앤지니어링","고려강선","엔씨소프트","한국필립모리스","일진글로벌","한국단자공업","유니드","동해펄프","동아타이어공업"
					,"흥화공업","파크랜드","캡스","심텍","삼양제넥스","에스엘서봉","우림개발","해양도시가스","선진","케이지케미칼","고속도로관리공단"
					,"에프앤에프","아우디폭스바겐코리아","한솔씨에스엔","엠케이전자","씨제이개발","샤니","신성이엔지","삼양통상","한라콘크리트","케이티링커스"
					,"신한캐피탈","하나금융지","하국하니웰","에스알에스코리아","롯데리아","삼화페인트공업","동서","디에치엘코리아","한국특수형강","로옴전자코리아"
					,"경동건설","동부정밀화학","한국동경시리콘","서해종합건설","영우디지탈","평화정공","태웅","광동제약","일건설","중부도시가스","금강공업"
					,"대보해운","에넥스","엘지생명과학","정원엔시스템","지엠비코리아","대성엘텍","한국동경전자","동양매직","한일합섬","지에스이피에스"
					,"구산토건","금호전기","사조산업","현대종합금속","삼탄","이트로닉스","디아이씨","세창","신동방","우성사료","국제상사","에스엘라이팅"
					,"평화발레오","한국개발금융","하나생명보험","부산롯데호텔","세메스","대유에이텍","에이치케이상호저축은행","케이티시코리아","우남건설"
					,"엠이엠씨코리아","스틸드림","대원석유","명화공업","금호미쓰이화학","홍원제지","다음커뮤니케이션","포철산기","일진베어링","윈스틸"
					,"신성반도체","기전산업","삼미","한국태양유전","일신건영","무진전자","국제종합기계","이랜텍","현대엔지니어링","도이치증권","농수산홈쇼핑"
					,"선우상선","대림수산","아이에이치엘","콘프로덕츠코리아","남한제지","명지건설","에스티엑스에너지","일동제약","대성산업가스","케이씨엔에이"
					,"한국세큐리트","건설화학공업","세원","지이머니","진로산업","해원에스티","오리엔탈정공","호반건설산업","솔로몬상호저축은행","피씨에이생명보험"
					,"한국썬마이크로시스템","아트라스비엑스","흥구석유","대원전선","삼보지질","네오디스","퍼시스","한마음금융","신세계인터내셔날","마니커"
					,"대한무역투자진흥공사","한화증권","신일건업","삼화석유","시멘스","호야건설","동원개발","한승종합건설","부국철강","보나에스","서원"
					,"대양금속","현대엘씨디","유성티엔에스","거양해운","비알코리아","한국엠에스디","대양석유","동화상협","한국상호저축은행","동아오토모티브"
					,"한국화인케미칼","노브랜드","내성기업","영풍전자","한국오라클","동화기업","강남도시가스","드림라인","전방","한전산업개발"
					,"아디다스코리아","디케이유아이엘","미원상사","신세계아이앤씨","한일제관","성우오토모티브","한국노바티스","성진지오텍","코리아써키트"
					,"한국미쓰이물산","네티션닷컴","유진기업","엠텍비젼","브리티쉬아메리칸토바코","메리츠증권","아이디에스","귀뚜라미보일러","신흥정밀"
					,"삼미상사","톰보이","기보스틸","아이아","한솔홈데코","코스틸","코스콤","대승실업","휴럭스","금호렌터카","노틸러스효성","세양건설산업"
					,"한국후지필름","경기고속","씨엠에이치아이영안개발","옥시레킷벤키저","구미도시가스","빅마트","대원택","엘지애드","한국씨티그룹캐피탈"
					,"삼양인터내셔날","유신코퍼레이션","헤라우스오리엔탈하이텍","한국허치슨터미널","대림통상","동방석유","태창철강","미창석유공업","대한제지"
					,"한국냉장","롯데물산","모보","이건산업","동아제분","엔브이에이치코리아","경동보일러","신한기계","동명중공업","한무개발","메디슨"
					,"대중공업","동아오츠카","리치먼드디앤씨","디스플레이테크","인지컨트롤스","모나미","선창산업","장은건설","유성기업","파라다이스글로벌카지노"
					,"부천역사","에이스종합건설","새한미디어","한국이엠씨컴퓨터시스템즈","신광","뱅뱅어패럴","대구백화점","서울증권","우정건설"
					,"디에치엘단자스에어앤오션","성우금속코일센타","필봉프라임엔터테인먼트","현대스틸산업","태양금속공업","한국리스여신","나산","피케이엘"
					,"덕양산업","코리아카본블랙","성창기업","비에스이","서울사료","유니퀘스트","매일경제신문사","한국에스엠씨공압","기륭전자","에스텍시스템"
					,"한솔케미칼","한국존슨앤드존슨메디칼","동양에스텍","미제강","더베이직하우스","태영인더스트리","태림포장공업","이지석유","경방","오토리브만도"
					,"남선석유","대창이앤티","쥬네브","삼안","범양건영","신한","에스케이증권","센트랄","제이유네트워크","효성인포메이션시스템","세광종합건설"
					,"코아로직","에이비비코리아","시몬느","신일하우징","부산상호저축은행","쿠쿠전자","삼영무역","벽산","동일고무벨트","씨제이푸드빌","페이퍼코리아"
					,"동아지질","원영건업","아이피케이","삼호에프앤지","델코","삼우이엠씨","동양이엔피","르메이에르건설","대현","케이티씨","동산업","남성해운","두원중공업","피치밸리"
					//공공기관(614개)
					,"한국조폐공사","한국수출입은행","한국투자공사","사립학교교직원연금관리공단","한국교육학술정보원","한국연구재단","한국과학창의재단","한국장학재단","강릉원주대학교치과병원"
					,"강원대학교병원","경북대학교병원","경상대학교병원","동북아역사재단","한국고전번역원","부산대학교병원","서울대학교병원","서울대학교치과병원","전남대학교병원","전북대학교병원"
					,"제주대학교병원","충남대학교병원","충북대학교병원","한국사학진흥재단","한국학중앙연구원","광주과학기술원","기초기술연구회","대구경북과학기술원","한국과학기술원"
					,"한국과학기술정보연구원","한국기초과학지원연구원","한국생명공학연구원","한국천문연구원","한국표준과학연구원","한국한의학연구원","한국항공우주연구원","한국해양연구원"
					,"한국과학기술연구원","한국원자력연구원","한국원자력의학원","평생교육진흥원","부산대학교치과병원","재외동포재단","한국국제교류재단","한국국제협력단","북한이탈주민지원재단"
					,"남북교류협력지원협회","대한법률구조공단","정부법무공단","한국법무보호복지공단","전쟁기념사업회","한국국방연구원","호국장학재단","공무원연금공단","한국정보화진흥원"
					,"한국승강기안전관리원","민주화운동기념사업회","한국관광공사","한국방송광고공사","서울올림픽기념국민체육진흥공단","한국문화예술위원회","영화진흥위원회","한국언론진흥재단"
					,"국제방송교류재단","한국콘텐츠진흥원","(사)한국문화예술회관연합회","경북관광개발공사","국립박물관문화재단","국민생활체육회","그랜드코리아레저(주)","대한장애인체육회"
					,"영상물등급위원회","예술의전당","(재)명동․정동극장","한국간행물윤리위원회","한국문학번역원","대한체육회","한국문화관광연구원","한국문화예술교육진흥원"
					,"한국문화진흥주식회사","한국영상자료원","한국체육산업개발(주)","(재)체육인재육성재단","게임물등급위원회","재단법인 국악방송","태권도진흥재단","한국저작권위원회"
					,"한국공예디자인문화진흥원","(재)한국공연예술센터","(재)예술경영지원센터","한국마사회","농수산물유통공사","축산물품질평가원","축산물위해요소중점관리기준원"
					,"농림수산식품기술기획평가원","한국농어촌공사","한국수산자원관리공단","가축위생방역지원본부","한국농림수산정보센터","한국어촌어항협회","한국가스공사","한국석유공사"
					,"한국전력공사","한국지역난방공사","한국중부발전(주)","한국수력원자력(주)","한국서부발전(주)","한국동서발전(주)","한국남부발전(주)","한국남동발전(주)","한국광물자원공사"
					,"대한석탄공사","한국무역보험공사","한국방사성폐기물관리공단","한국석유관리원","대한무역투자진흥공사","에너지관리공단","한국세라믹기술원","우체국물류지원단"
					,"우체국예금보험지원단","한국가스안전공사","한국광해관리공단","한국디자인진흥원","한국산업기술시험원","한국산업기술진흥원","한국산업기술평가관리원","한국산업단지공단"
					,"한국에너지기술평가원","한국우편사업진흥원","한국전기안전공사","한국전력거래소","정보통신산업진흥원","기초전력연구원","인천종합에너지(주)","(주)강원랜드"
					,"(주)한국가스기술공사","한국생산성본부","한국전력기술주식회사","한국표준협회","한일산업기술협력재단","한전KDN","한전KPS(주)","한전원자력연료주식회사"
					,"한국원자력문화재단","별정우체국 연금관리단","연구개발특구지원본부","산업기술연구회","한국건설기술연구원","한국기계연구원","한국생산기술연구원","한국식품연구원"
					,"한국에너지기술연구원","한국전기연구원","한국전자통신연구원","한국지질자원연구원","한국철도기술연구원","한국화학연구원","전략물자관리원","(재)우체국시설관리단"
					,"한국로봇산업진흥원","국민연금공단","건강보험심사평가원","국민건강보험공단","한국보건산업진흥원","한국노인인력개발원","한국보건복지정보개발원","건강보험심사평가원"
					,"국민건강보험공단","한국보건산업진흥원","한국노인인력개발원","한국보건복지정보개발원","국립공원관리공단","한국환경공단","한국환경산업기술원","수도권매립지관리공사"
					,"근로복지공단","한국고용정보원","한국산업안전보건공단","한국산업인력공단","한국장애인고용공단","학교법인한국폴리텍","노사발전재단","한국기술교육대학교","한국사회적기업진흥원"
					,"한국승강기안전기술원","한국청소년상담원","한국청소년활동진흥원","인천국제공항공사","한국공항공사","부산항만공사","인천항만공사","한국토지주택공사","대한주택보증주식회사"
					,"제주국제자유도시개발센터","한국감정원","한국도로공사","한국수자원공사","한국철도공사","여수광양항만공사","교통안전공단","한국건설교통기술평가원","한국시설안전공단"
					,"한국철도시설공단","대한지적공사","선박안전기술공단","한국해양수산연수원","코레일네트웍스(주)","코레일로지스(주)","코레일유통(주)","코레일테크(주)","코레일관광개발(주)"
					,"(주)한국건설관리공사","주택관리공단(주)","울산항만공사","주식회사 인천항보안공사","주식회사 부산항보안공사","한국해양과학기술진흥원","항로표지기술협회","해양환경관리공단"
					,"경제인문사회연구회","과학기술정책연구원","국토연구원","대외경제정책연구원","산업연구원","에너지경제연구원","정보통신정책연구원","통일연구원","한국개발연구원","한국교육개발원"
					,"한국교육과정평가원","한국교통연구원","한국노동연구원","한국농촌경제연구원","한국법제연구원","한국보건사회연구원","한국여성정책연구원","한국조세연구원","한국직업능력개발원"
					,"한국청소년정책연구원","한국해양수산개발원","한국행정연구원","한국형사정책연구원","한국환경정책평가연구원","한국방송통신전파진흥원","한국인터넷진흥원","한국과학기술기획평가원"
					,"한국원자력안전기술원","한국원자력통제기술원","한국자산관리공사","기술신용보증기금","신용보증기금","예금보험공사","한국주택금융공사","한국에탁결제원","한국거래소","코스콤"
					,"한국기업데이터주식회사","한국정책금융공사","한국소비자원","독립기념관","한국보훈복지의료공단","88관광개발","국방과학연구소","국방기술품질원","한국문화재보호재단","녹색사업단"
					,"농업기술실용화재단","중소기업진흥공단","중소기업기술정보진흥원","소상공인진흥원","시장경영진흥원","신용보증재단중앙회","중소기업유통센터","한국벤처투자","창업진흥원"
					,"한국발명진흥회","한국특허정보원","(재)한국지식재산연구원","한국지식재산보호협회","한국희귀의약품센터","도로교통공단","한국소방산업기술원","서울특별시청","강남구청","강동구청"
					,"강북구청","강서구청","관악구청","광진구청","구로구청","금천구청","노원구청","도봉구청","동대문구청","동작구청","마포구청","서대문구청","서초구청","성동구청","성북구청","송파구청"
					,"양천구청","영등포구청","용산구청","은평구청","종로구청","중구청","중랑구청","부산광역시청","강서구청","금정구청","남구청","동구청","동래구청","부산진구청","북구청","사상구청"
					,"사하구청","서구청","수영구청","연제구청","영도구청","중구청","해운대구청","기장군청","대구광역시청","남구청","달서구청","동구청","북구청","서구청","수성구청","중구청","달성군청"
					,"인청광역시청","계양구청","남구청","남동구청","동구청","부평구청","서구청","연수구청","중구청","강화군청","옹진군청","광주광역시청","광산구청","남구청","동구청","북구청","서구청"
					,"대전광역시청","대덕구청","동구청","서구청","유성구청","중구청","울산광역시청","남구청","동구청","북구청","중구청","울주군청","경기도청","고양시청","과천시청","광명시청","광주시청"
					,"구리시청","군포시청","김포시청","남양주시청","동두천시청","부천시청","성남시청","수원시청","시흥시청","안산시청","안성시청","안양시청","양주시청","오산시청","용인시청"
					,"의왕시청","의정부시청","이천시청","파주시청","평택시청","포천시청","하남시청","화성시청","가평군청","양평군청","여주군청","연천군청","강원도청","강릉시청","동해시청"
					,"삼척시청","속초시청","원주시청","춘천시청","태백시청","고성군청","양구군청","양양군청","영월군청","인제군청","정선군청","철원군청","평창군청","홍천군청","화천군청"
					,"횡성군청","충청북도도청","제천시청","청주시청","충주시청","괴산군청","단양군청","보은군청","영동군청","옥천군청","음성군청","증평군청","진천군청","청원군청","충청남도도청"
					,"공주시청","계룡시청","논산시청","보령시청","서산시청","아산시청","천안시청","금산군청","당진시청","부여군청","서천군청","예산군청","청양군청","태안군청","홍성군청"
					,"세종특별자치시청","전라북도도청","군산시청","김제시청","남원시청","익산시청","전주시청","정읍시청","고창군청","무주군청","부안군청","순창군청","완주군청","임실군청"
					,"장수군청","진안군청","전라남도도청","광양시청","나주시청","목포시청","순천시청","여수시청","강진군청","고흥군청","곡성군청","구례군청","담양군청","무안군청","보성군청"
					,"신안군청","영광군청","영암군청","완도군청","장성군청","장흥군청","진도군청","함평군청","해남군청","화순군청","경상북도도청","경산시청","경주시청","구미시청","김천시청"
					,"문경시청","상주시청","안동시청","영주시청","영천시청","포항시청","고령군청","군위군청","봉화군청","성주군청","영덕군청","영양군청","예천군청","울릉군청","울진군청"
					,"의성군청","청도군청","청송군청","칠곡군청","경상남도도청","거제시청","김해시청","밀양시청","사천시청","양산시청","진주시청","창원시청","통영시청","거창군청","고성군청"
					,"남해군청","산청군청","의령군청","창녕군청","하동군청","함안군청","함양군청","합천군청","제주특별자치도청","서귀포시청","제주시청","공공미디어연구소","노들장애인야간학교"
					,"민족문제연구소","새로운 사회를 여는 연구원","작은자야간학교","참교육을 위한 전국학부모회","코리아연구원","학벌없는사회","한국노동사회연구소","희망제작소","로터스월드"
					,"인권과 평화를 위한 국제민주연대","지구촌나눔운동","페어트레이드코리아","한국공정무역연합","공익변호사그룹 공감","문화연대","참여연대","전국귀농운동본부","전국농민회총연맹"
					,"전국민주노동조합총연맹","한국비정규노동센터","한국독립영화협회","경상남도장애인종합복지관","볼런티어21","사회복지연대","서울시남부장애인종합복지관","서울시립지적장애인복지관"
					,"우양","행복한세상복지센터","희망의 러브하우스","미디어스","민주언론시민연합","언론소비자주권 국민캠페인","진실을 알리는 시민","막달레나공동체","반성매매인권행동 이룸"
					,"언니네트워크","평화를 만드는 여성회","한국레즈비언상담소","한국성폭력상담소","한국여성노동자회","한국여성단체연합","한국여성민우회","한국여성의전화","한국여성재단"
					,"한국YWCA연합회","건강사회를 위한 약사회","건강사회를 위한 치과의사회","건강세상네트워크","인도주의실천의사협의","참의료실현 청년한의사회","푸르메재단","다누리","다산인권센터"
					,"민주화운동기념사업회","부산민주항쟁기념사업회","아시아의 친구들","어린이어깨동무","이주민과 함께","인권연대","한국게이인권운동단체 친구사이","한국성적소수자문화인권센터"
					,"두리하나","영등포산업선교회","인드라망생명공동체","고양시민회","열린사회시민연합","원주시민연대","평화와 참여로 가는 인천연대","KYC(한국청년연합)","희망나눔동작네트워크"
					,"동북아평화연대","청년평화센터 푸름","평화네트워크","평화박물관 건립추진위원회","국립공원을지키는시민의모임","녹색교통운동","생태지평연구소","여성환경연대","지리산생명연대"
					,"한국내셔널트러스트","환경운동연합","환경정의","동물보호시민단체 카라","한국동물복지협회","동물자유연대","공정거래위원회","공정위","광고비"
					
					// 긴급
					,"KIA", "기아", "기아차", "기아자동차", "모닝", "올 뉴 모닝", "모닝 바이퓨얼", "기아 모닝", "프라이드", "프라이드 세단", "프라이드 해치백", "K3", "K3쿱", "K3 해치백", "K3 디젤", "K5", "더 뉴 K5", "K5 터보", "K5 하이브리드", "K7", "더 뉴K7", "프레스티지 K7", "K7 하이브리드", "K9", "프레스티지 K9", "레이", "기아 레이", "기아 레이 EV", "기아 레이 밴", "레이 밴", "레이 EV", "쏘울", "쏘울 GDI", "뉴 쏘울", "올 뉴 쏘울 ", "카렌스", "올 뉴 카렌스", "카렌스 LPG", "뉴 카렌스", "스포티지", "스포티지R", "뉴 스포티지R ", "쏘렌토", "쏘렌토R", "뉴 쏘렌토R ", "모하비", "카니발", "카니발R", "그랜드 카니발", "그랜드 카니발R", "카니발 하이리무진", "카니발 이지무브", "카니발  YP", "올 뉴 카니발"
					
					//2014-08/19 추가
					,"올리브영","Oliveyoung","왓슨스","Watsons","롭스","LOHBs","롯데리아","롯데랴","lotteria","롯대리아","롯리","로떼리아","로떼랴","노떼랴","노떼리아","맥날","맥도널드","맥도날드","마그도나르도","매그도나르도"
					,"Mcdonalds","버거킹","벌거킹","burgerking","케이에프씨","케이에푸씨","kfc","파파이스","파파이쓰","popeyes","TGI","TGIF","티지아이","나뚜루","natuur","던킨도너츠","던킨도넛","던킨","dunkin donuts"
					,"dunkin","미스터도너츠","미스터도넛","mister donut","베스킨 ","배스킨 ","Baskin Robinson","베라","베니건스","배니건스","bennigans","빕스","vips","스타벅스","스벅","starbucks","별다방","아웃백"
					,"outback","앗백","엔젤리너스","앤젤리너스","엔제리너스","angelinus","엔젤커피","엔젤인어스","카페베네","caffebene","카페베내","바귀베네","커피빈","콩다방","coffeebean","크리스피 ","krispy","탐앤탐스"
					,"탐탐","tomntoms","탐엔탐스","하겐다즈","하갠다즈","하겐더즈","haagendazs","할리스","hollys"
			};
			for(String keyword : keywords){
				keywordList.add( keyword );
			} 
			
		}
//		if("4".equalsIgnoreCase(consumer)){
//			String[] keywords  = {
//					// 긴급
//					"KIA", "기아", "기아차", "기아자동차", "모닝", "올 뉴 모닝", "모닝 바이퓨얼", "기아 모닝", "프라이드", "프라이드 세단", "프라이드 해치백", "K3", "K3쿱", "K3 해치백", "K3 디젤", "K5", "더 뉴 K5", "K5 터보", "K5 하이브리드", "K7", "더 뉴K7", "프레스티지 K7", "K7 하이브리드", "K9", "프레스티지 K9", "레이", "기아 레이", "기아 레이 EV", "기아 레이 밴", "레이 밴", "레이 EV", "쏘울", "쏘울 GDI", "뉴 쏘울", "올 뉴 쏘울 ", "카렌스", "올 뉴 카렌스", "카렌스 LPG", "뉴 카렌스", "스포티지", "스포티지R", "뉴 스포티지R ", "쏘렌토", "쏘렌토R", "뉴 쏘렌토R ", "모하비", "카니발", "카니발R", "그랜드 카니발", "그랜드 카니발R", "카니발 하이리무진", "카니발 이지무브", "카니발  YP", "올 뉴 카니발"
//			};
//			
//			for(String keyword : keywords){
//				keywordList.add( keyword );
//			} 
//		}
//		
//		if("5".equalsIgnoreCase(consumer)){
//			String[] keywords  = {
//					// 긴급
//					"KIA", "기아", "기아차", "기아자동차", "모닝", "올 뉴 모닝", "모닝 바이퓨얼", "기아 모닝", "프라이드", "프라이드 세단", "프라이드 해치백", "K3", "K3쿱", "K3 해치백", "K3 디젤", "K5", "더 뉴 K5", "K5 터보", "K5 하이브리드", "K7", "더 뉴K7", "프레스티지 K7", "K7 하이브리드", "K9", "프레스티지 K9", "레이", "기아 레이", "기아 레이 EV", "기아 레이 밴", "레이 밴", "레이 EV", "쏘울", "쏘울 GDI", "뉴 쏘울", "올 뉴 쏘울 ", "카렌스", "올 뉴 카렌스", "카렌스 LPG", "뉴 카렌스", "스포티지", "스포티지R", "뉴 스포티지R ", "쏘렌토", "쏘렌토R", "뉴 쏘렌토R ", "모하비", "카니발", "카니발R", "그랜드 카니발", "그랜드 카니발R", "카니발 하이리무진", "카니발 이지무브", "카니발  YP", "올 뉴 카니발"
//			};
//			for(String keyword : keywords){
//				keywordList.add( keyword );
//			} 
//		}
		if("4".equalsIgnoreCase(consumer)){
			String[] keywords  = {
					"이병헌","김윤석","송강호","장동건","현빈","최민식","하정우","김명민","정우성","소지섭","조인성","강동원","황정민","김수현","원빈","이민호","차승원","이승기","배용준","박해일"
					,"유지태","백윤식","안성기","박상원","신현준","송승헌","다니엘헤니","권상우","정준호","지진희","고수","공유","이준기","김래원","차태현","이범수","박중훈","유아인","박시후","이정재","이제훈"
					,"조정식","정석원","조승우","류승범","김수로","오달수","신정근","고창석","설경구","류승룡","김무열","이경영","진구","배수빈","정재영","최원영","박원상","명계남","문성근","유오성","권현상"
					,"윤상현","하지원","김혜수","전지현","손예진","고현정","임수정","수애","이민정","이나영","엄정화","김하늘","한가인","이영애","김태희","고소영","이미연","김남주","이요원","최지우","송혜교"
					,"문근영","한예슬","김아중","신민아","공효진","한지민","김민희","민효린","배두나","전도연","강수연","김고은","김수미","한혜진","심은경","예지원","안미나","윤진서","배종옥","문소리","김윤진"
					,"서영희","류현경","강예원","김혜자","김옥빈","추자현","선우선","박시연","김미숙","한은정","황우슬혜","이하나","황보라","이태란","정유미","윤지혜","강성연","엄지원","고아성","최정윤","김지수"
					,"강혜정","오지혜","조은지","박진희","박한별","이지아","박예진","조여정","박하선","송윤아","하희라","정려원","이다해","최강희","문채원","박보영","서태지","싸이","비","박진영","유천","준수"
					,"재중","김현중","탑=최승현","지드래곤","태양","대성","승리","유노윤호","최강창민","닉쿤","택연","준호","찬성","우영","준케이","이특","희철","한경","예성","강인","신동","성민","은혁","동해"
					,"시원","려욱","기범","규현","장현승","이기광","용준형","손동운","윤두준","양요섭","정용화","조권","온유","종현","Key","민호","태민","케이윌","나얼","서인국","김종국","윤건","허각","은지원"
					,"호야","시완","김종민","황광희","이준","이종현","강민혁","성시경","하하","김동완","전진","신혜성","에릭","이민우","앤디","문희준","임슬옹","동호","이승철","김태원","이현","존박","임윤택","장범준"
					,"세븐","버벌진트","길","개리","미르","천둥","박상민","박현빈","장기하","하림","윤종신","JK김동욱","김범수","조성모","이적","윤상","유희열","김정민","San E","박효신","윤민수","이수","테이","신용재"
					,"정엽","고유진","김조한","송창식","김연우","타이거JK","더원","박완규","변진섭","이정","이승환","신승훈","김태우","김건모","김경호","바비킴","조관우","임재범","붐","더블 케이"
					,"H-유진","마리오","스컬","낯선","김진표","주석","데프콘","김성규","정동하","박지헌","간종욱","창민","진원","JB","타블로","강타","박재범","데니안","조장혁","에반","김형준","노지훈"
					,"김현철","나훈아","조용필","태진아","남진","현철","설운도","송대관","이효리","아이유","보아","손담비","윤아","수영","효연","유리","태연","제시카","티파니","써니","서현","선예","소희","예은"
					,"유빈","혜림","박봄","박산다라","공민지","씨엘","유이","나나","리지","수지","현아","강지영","정니콜","한승연","박규리","구하라","효린","장재인","백지영","박정현","설리","크리스탈","빅토리아"
					,"엠버","루나","효민","은정","보람","지연","큐리","소연","아름","에일리","이하이","가인","별","정은지","NS윤지","강민경","한선화","주연","장나라","전효성","서인영","메이비","채연","거미"
					,"홍진영","장윤정","윤하","양파","인순이","아이비","주니엘","G.NA","린","알리","소유","지아","보라","다솜","박지민","백아연","가희","전지윤","허가윤","권소현","남지현","이소라","이영현","BMK"
					,"소향","서문탁","앤","윤미래","김윤아","박기영","장혜진","이은미","한영애","옥주현","적우","박선주","화요비","미료","제아","나르샤","장희진","길미","김완선","강수지","베이지","혜령","이수영"
					,"임정희","영지","JOO","다나","요조","이보람","차지연","레이나","이미자","빅뱅","JYJ","소녀시대","2PM","원더걸스","2NE1","애프터스쿨","미쓰에이","동방신기","카라","씨스타","슈퍼주니어"
					,"비스트","비원에이포","인피니트","틴탑","보이프랜드","샤이니","엠블랙","블락비","씨엔블루","FT아일랜드","신화","2AM","포미닛","에프엑스","티아라","달샤벳","노을","브라운아이드걸스","YB"
					,"리쌍","에픽하이","에이핑크","오렌지카라멜","걸스데이","스피카","먼데이 키즈","10Cm","버스커버스커","B.A.P","다비치","다이나믹듀오","제아","시크릿","유키스","DJDOC","슈프림팀","에이트"
					,"부활","쥬얼리","넬","클래지콰이","체리필터","울랄라세션","헬로비너스","AOA","소녀시대_태티서","어반 자카파","포맨","마이티 마우스","럼블피쉬","프라이머리","노라조","브라운아이드소울"
					,"피프틴앤드","스윗소로우","VOS","바이브","디셈버","SG워너비","포맨","드렁큰타이거","국카스텐","시나위","자우림","나인뮤지스","써니힐","허밍 어반 스테레오","래드애플","더 씨야","C-CLOWN"
					,"가비엔제이","lzi","썸데이","제이레빗","Bounce","지누션","EXO","EXO-K","EXO-M","레인보우","보이프렌드","비투비","장근석","송중기","유승호","김남길","김성수","이광수","정일우","여진구"
					,"김범","윤시윤","이상윤","박해진","김태훈","이다윗","지현우","손현주","김상중","류승수","박근형","엄기준","곽도원","최다니엘","권해효","장현성","류덕환","안내상","이선균","이성민","이시언"
					,"성동일","송종호","조성하","김영철","장용","이한위","김일우","윤기원","허정민","안석환","백성현","이장우","박건형","윤주상","박영규","신승환","조희봉","줄리엔강","김민종","이종혁"
					,"김우빈","정은표","이원종","김응수","김병세","연우진","권오중","한정수","김용건","박준규","김광규","한진희","전광렬","최수종","김지석","남궁민","김승수","박광현","유준상","김상호"
					,"이희준","김원준","오민석","김진우","전재형","송재희","송재림","선우재덕","안재욱","이필모","이종원","조진웅","조달환","이세창","박기웅","이규한","전노민","손병호","주상욱","이상우"
					,"엄효섭","박상면","윤은혜","구혜선","이영유","박지영","김희선","장미희","김희애","채시라","고두심","박효주","신애라","송지효","김유정","이보영","박정아","염정아","명세빈","안혜경"
					,"남상미","유인나","고준희","장신영","김성령","이연희","황정음","송선미","선우용여","신소율","문채원","이유비","신세경","김새론","이미숙","장희진","고수희","윤해영","유재석","신동엽"
					,"강호동","정형돈","김준현","김원효","김기열","이수근","김병만","박명수","노홍철","정준하","김현철","이경규","남희석","정종철","김제동","김용만","박준형","이휘재","유세윤","이영자"
					,"박미선","신봉선","정경미","이경실","박지선","김신영","정주리","안영미","강유미","조혜련","김지선","신보라","김경아","김지혜","백보람","오나미","곽현화","김영희","허안나","김지민"
					,"박지성","구자철","기성용","손흥민","이영표","이청용","차두리","박주영","지동원","남태희","김보경","백성동","김민우","백승호","이승우","이동국","안정환","홍명보","황선홍","유상철"
					,"하석주","김병지","윤석영","이정수","이승엽","박찬호","이용규","김선빈","강정호","김현수","이범호","최정","강민호","조인성","김현수","손시헌","김선빈","강정호","김주찬","김강민",
					"고영민","박병호","박석민","손시헌","강정호","이택근","김강민","박용택","류현진","김광현","윤석민","봉중근","이용찬","장원삼","안지만","권혁","박희수","손승락","오승환","유원상"
					,"추신수","정근우","이대호","김태균","이진영","최정","김동주","정대현","임창용","양준혁","홍성흔","정현욱","김응룡","김시진","김경문","선동렬","하승진","우지원","문경은","현주협","강동희"
					,"허재","이상민","양동근","변연하","김연경","한송이","김세진","신진식","문성민","임요한","박태환","정다래","김연아","곽민정","손연재","양학선","신지수","김수면","이용대"
					,"나성범","이민호"
					
					// 긴급
					,"KIA", "기아", "기아차", "기아자동차", "모닝", "올 뉴 모닝", "모닝 바이퓨얼", "기아 모닝", "프라이드", "프라이드 세단", "프라이드 해치백", "K3", "K3쿱", "K3 해치백", "K3 디젤", "K5", "더 뉴 K5", "K5 터보", "K5 하이브리드", "K7", "더 뉴K7", "프레스티지 K7", "K7 하이브리드", "K9", "프레스티지 K9", "레이", "기아 레이", "기아 레이 EV", "기아 레이 밴", "레이 밴", "레이 EV", "쏘울", "쏘울 GDI", "뉴 쏘울", "올 뉴 쏘울 ", "카렌스", "올 뉴 카렌스", "카렌스 LPG", "뉴 카렌스", "스포티지", "스포티지R", "뉴 스포티지R ", "쏘렌토", "쏘렌토R", "뉴 쏘렌토R ", "모하비", "카니발", "카니발R", "그랜드 카니발", "그랜드 카니발R", "카니발 하이리무진", "카니발 이지무브", "카니발  YP", "올 뉴 카니발"
					
					//2014-08/19 추가
					,"올리브영","Oliveyoung","왓슨스","Watsons","롭스","LOHBs","롯데리아","롯데랴","lotteria","롯대리아","롯리","로떼리아","로떼랴","노떼랴","노떼리아","맥날","맥도널드","맥도날드","마그도나르도","매그도나르도"
					,"Mcdonalds","버거킹","벌거킹","burgerking","케이에프씨","케이에푸씨","kfc","파파이스","파파이쓰","popeyes","TGI","TGIF","티지아이","나뚜루","natuur","던킨도너츠","던킨도넛","던킨","dunkin donuts"
					,"dunkin","미스터도너츠","미스터도넛","mister donut","베스킨 ","배스킨 ","Baskin Robinson","베라","베니건스","배니건스","bennigans","빕스","vips","스타벅스","스벅","starbucks","별다방","아웃백"
					,"outback","앗백","엔젤리너스","앤젤리너스","엔제리너스","angelinus","엔젤커피","엔젤인어스","카페베네","caffebene","카페베내","바귀베네","커피빈","콩다방","coffeebean","크리스피 ","krispy","탐앤탐스"
					,"탐탐","tomntoms","탐엔탐스","하겐다즈","하갠다즈","하겐더즈","haagendazs","할리스","hollys"
			};
			for(String keyword : keywords){
				keywordList.add( keyword );
			} 
		} if("5".equalsIgnoreCase(consumer)){
			String[] keywords  = {
					"커피타임","휴식","수다","식사","치료","생각","다이어트","운동","헬스","런닝","웨이트","단련","소화","퇴짜","대기","스트레스","모임","동호회","데이트","기부","칠순잔치","만남","투표","기념일","전화"
					,"등산","통화","감상","영화","낚시","수영","조깅","드라이브","셀카","스트레칭","다이빙","캠핑","촬영","꽃구경","나들이","산책","간식","디저트","브런치","신혼여행","임신","투병","쇼핑","아이쇼핑","다과상","겨울"
					,"단풍놀이","집들이","은퇴","아침식사","점심식사","저녁식사","야식","마실","벚꽃구경","우연히","진료","포럼","강의","독서","티타임","화장","공부","음악감상","영화감상","동창모임","업무","출장"
					,"바캉스","문자","뮤지컬","공연","연말모임","크리스마스파티","할로윈파티","면접","프리젠테이션","요가","요리","노래","처방","운전","줄넘기","태풍","폭우","산사태","콘서트","갈라쇼","워크샵","상견례"
					,"폐백","시험","토론","구직","결정","대출","돌잔치","면접시험","파티","맞선","퇴근","출근","봄","장례","가을","결혼","약혼","술자리","근무","관광","밤샘","야근","영화관람","시청","관람","수업","귀경","상경"
					,"가족모임","발표","크리스마스","회의","여행","야구","결혼식","환갑잔치","생일","졸업식","입학식","미팅","컨퍼런스","소개팅","축구","비오는날","축제","해외여행","계모임","추모","하산","석가탄신일","트래킹"
					,"싸움","화해","친목","복귀","입원","퇴원","이별","TV시청","벚꽃놀이","봉사활동","샤워","폭풍","부처님오신날","고민","흥얼거리다","먹다","분석","불화","금혼식","마시다","빙벽등반","달리다","만들다","사격"
					,"살인","상담","불꽃놀이","취업","차이다","빌리다","체하다","석식","선거","내기","선거운동","선발전","어지럽다","설치","타다","걷다","성추행","세계일주","뛰다","세미나","소송","분실하다","수능","수료식","수사"
					,"수색","취직","수술","소개하다","버리다","레이싱","마감","마사지","메일링","모니터링","목욕","문자대화","물물교환","반납","발송","방송사고","방학식","배급","배식","번역","범죄","베이킹","변호하다","병구완","보육"
					,"수여식","수확","스노쿨링","시위","스키","스킨스쿠버","스터디","시승","스쿼시","스케이트","실연","실직","실험","씻을때","아르바이트","안내","안마","알바","시합","암벽등반","야영","약혼식","연설","영상통화","영업"
					,"온라인게임","유산","유혹","음주","응급처치","이적","이혼","인쇄","인적성검사","인터뷰","입맞춤","입시","작성","작업","잠자다","장난","재대","재판","재혼","전국일주","전달","전복되다","전야제","전역","전쟁","절도"
					,"제본","제사","제작발표회","조난","조련","조리","조문","졸업","종방연","종방파티","진단","진수식","진행","차례","참여","채용","폭행","피난","피랍","픽업","투쟁","혁명","협박","혼인식","홈베이킹","화상통화","화재"
					,"환불","훈련","흥정","심부름","찍다","리필하다","업로드","다운로드","부팅","복사하다","가뭄","개발","개최","수비하다","경고","광고기획","낮잠","네일아트","대련","데뷔","도망","등교","레드카드","레벨업","메이크업"
					,"추천하다","무상수리","배달","법회","보충수업","복습","부검","비행","사냥","사전관리","살림","살인사건","살해","선박사고","세례","세수","세안","소독","수리","주문","한정판매","간호","감금","강간","개업식","개학식"
					,"거래","검거","검사","검색","검시","고소","경기","고사","교통사고","교환","구인","첫출근","기획","구입","구조","귀순","청소","단종","급식","기다리다","체벌","캠프파이어","추수","대립","추첨","납치","노가다"
					,"노동","녹음","녹화","다툼","대입","출산","출연","카톡대화","대피","데모","컴백","키스","연애","탈북","테스트","통역","도박","통화중","판촉","패러글라이딩","구걸하다","페스티벌","도주","회복하다","포장"
					,"풀다","드라이빙","라디오청취","청탁","청약","감사","경매","예약판매","할인판매","헤어짐","파일공유","로그인","회원가입","접속","등록","입력","완료","쁘띠성형","완치","재구매","대행"
					,"마중","배웅","업무처리","소비","낙하","통제","작사","작곡","안무","댄싱","광고","사업","운영","운용","우대","적립","창업","저항","감기","비난","개방","발견","탐사","탐구"
					,"대치","봉쇄","요구","돌려막기","상환","출산휴가","공강","자체휴강","플래시몹","임용","임명","승진","배치","설계","기념식","대출서비스","대리운전","재테크","카드발급","무료교환"
					,"추가","할인","납입","현금화","마케팅","구매대행","소개","주선","공개사과","공지","통폐합","무제한","공식화","바자회","할부구매","할부구입","현금서비스","토의","바로가기","론칭행사","판매"
					,"진출","출범","웃음","위장","물품교환","새로고침","필터링","흡수","추출","입문","언쟁","달맞이","강강수월래","인형극","원망","프리허그","백허그","매점매석","중단","논의","납북"
					,"위령제","공소기각","지시","감량","훈육","노숙","강압","층간소음","불륜","단일화","라식","라섹","충돌","징역","혼인신고","상세검색","피서","서리","워크숍","구현","중계","회식"
					,"음주단속","불황","공개","육아","통계","캐스팅","전국투어","시구","사고","구매","매매","판정","소환","출두","사업실패","출생","낙마","재직","재학","변신","교정","전화통화","확인"
					,"공양","스캔들","인정","연장","선정","정발","정식발매","수선","개통식","보정","수입","수출","개명","열애","수정","회수","습격","퇴장","행군","행진","육아휴직","휴직","퇴사","퇴직","사직"
					,"권고사직","리허설","탈출","계산","급발진사고","실명","재건축","조회","수면","승소","시술","신고","신장개업","실종","쓰나미","야자","연습","연주","예배","예불","예습","요청"
					,"윈도쇼핑","윈도우쇼핑","유괴","인터넷쇼핑","인테리어","입양","자습","자율학습","자퇴","잔업","잠금","장식","재현","전단살포","점검","정면돌파","조사","주식투자","중절수술","지진"
					,"찬송","참가","참석","채광","청취","축가","출격","출시","쿠데타","탐문수사","탑승","퇴학","투신","튜닝","파양","패디큐어","편집","폭로","폭설","피부관리","피살","피소","피팅","하교","학고","학습"
					,"합의","핫요가","항해","헌팅","현장검증","협상","부상","연재","의견조율","업그레이드","출마","리모델링","개설","오픈","성형","예약","우승","질문","자수","재봉질","양육","과외","게시","개시"
					,"마수걸이","귀화","연말정산","연탄배달","해외후원","아동후원","후원","부도","출입통제","사과","귀국","폐지","후회","삭제","사재기","분양","철거","뜀박질","취재","유학","망명","이민"
					,"신체검사","집단소송","윗몸일으키기","마라톤","고백","합병","허가","출판","타격","인수","보증","김장","주행시험","제비뽑기","금지","이벤트","항의","집회","대리만족","졸업작품전시회"
					,"출품","사망","관리","커피타임","이틀","저녁때","복날","출근시간","해뜰무렵","한여름","흐린날","발렌타인데이","화이트데이","점심","해질녘","저녘","간식시간","정오","한밤중","등교시간","퇴근시간"
					,"한글날","입춘","경칩","백중","야밤","겨울","티타임","돌잔치","밤","아침","오후","오전","새벽","날마다","여름","봄","가을","저녁","월요일","화요일","수요일","목요일","크리스마스","결혼식","장례식"
					,"설날","추석","생일","금요일","토요일","일요일","어린이날","어버이날","스승의날","석가탄신일","개천절","광복절","휴일","어제","그저께","주말","평일","개강날","개봉날","개봉일","결제날","공고날"
					,"공휴일","놀토","늦가을","단오","단풍철","내일","발표날","추첨일","개막일","예약일","내원일","퇴원일","발인일","채용일","이벤트데이","건기","제작일","데뷔날","폐문시간","오픈시간","개문시간"
					,"개최일","세일기간","자정","야자시간","자습시간","수업시간","사건발생일","식사시간","방영시간","개원시간","프라이데이나이트","프라이데이나잇","연휴","황금연휴","샌드위치휴일","할인기간"
					,"회의시간","운동회날","출산일","가을철","겨울철","봄철","늦여름","늦겨울","초봄","초여름","초겨울","꽃놀이철","월급입금일","축제기간","퇴직일","영업시간","글피","독립기념일","로즈데이"
					,"마감일","말복","말일","맑은날","마감날","배송일","불금","빨간날","빼빼로데이","산호혼식","삼일절","생신","수능날","시험기간","식목일","야간","요금납부일","월급날","입국날","입학식"
					,"정월대보름","제헌절","종강날","첫날","초가을","초복","초저녁","출국날","출시일","칠월칠석","칠순잔치날","탄생일","탄신일","한겨울","한정판매기간","할로윈데이","합격발표날","헤어진 날"
					,"현충일","회갑잔치날","휴가기간","김장철","임용일","그믐","휴식기","기말고사 기간","납부일","유효기간","내년","내후년","입추","처서","당금","아침나절","땅거미","달포","정각","늦은오후"
					,"상강","동지","만기일","부활절","춘분","청명","곡우","입동","삼복","주문일","마지막날","공강시간","자투리시간","당일","제조일","내달","해질무렵","이브날","구정","설연휴","신정","한가위"
					,"중추절","삼짇날","가입시기","대낮","한낮","전날","간식타임","합의날짜","석방일","접수시간","예약시간","예약날짜","약속시간","약속날짜","업무시간","점심시간","계약일","제삿날","기일"
					,"할로윈","출국시간","연재날","경기시간","신발가게","모자가게","집","부페","뷔페","패밀리레스토랑","친구네","친구집","기숙사","하숙집","군대","내무반","욕실","교회","절","아지트","엘리베이터"
					,"승강기","에스컬레이터","맛집","피시방","피씨방","겜방","비디오방","DVD방","오락실","리조트","데이트코스","골프장","수영장","목욕탕","찜질방","스키장","사우나","낚시터","낚시장","캠핑장"
					,"어린이대공원","롯데월드","패스트푸드점","서울랜드","버스","비행기","크루즈","유람선","약국","캠퍼스","소파","침대","안방","공부방","주방","거실","욕조","커피전문점","분식집","구내식당"
					,"매점","떡볶이집","고기집","횟집","동네","마트","친정","외가","시댁","은행","편집샵","사진관","현상소","구두수선소","세탁소","동물병원","도서관","독서실","공중화장실","공공장소",
					"방송국","아파트","빌라","주택","다세대","반지하","원룸","호프집","치킨집","맥주집","초가집","서점","인포메이션","안내소","경찰서","파출소","소방서","응급실","경비실","경비소","면접장"
					,"파티장","학원","정류장","커피숍","카페","식당","레스토랑","병원","로비","호텔","여관","숙소","백화점","편의점","슈퍼","여행지","모텔","야구장","축구장","농구장","배구장","운동장"
					,"푸드코트","바닷가","바다","계곡","극장","소극장","공연장","CGV","아쿠아리움","주차장","화장실","시장","대학가","대학로","고등학교","중학교","초등학교","시청","사거리","교차로","다방"
					,"휴게실","휴게소","잠실운동장","사무실","회사","장례식장","학교","커피숖","고속도로","도로","횡단보도","테라스","베란다","옥상","놀이터","고수부지","해변","백사장","병실","한강","홍대"
					,"우리집","홈플러스","이마트","코스트코","잔디밭","광안리","경포대","제주도","음식점","클럽","나이트","길거리","공원","콘서트장","옷가게","강의실","산정상","별장","교보문고","결혼식장"
					,"성당","섬","공항","술집","유치원","들판","호숫가","노래방","애견카페","고양이카페","수술실","입원실","애견미용실","애완용품점","물류창고","택배상하차장","늪","갈대밭","화산지대","공장","유리온실"
					,"비닐하우스","논","서비스센터","공식서비스센터","디자인실","부동산","복덕방","옥탑방","근정전","대웅전","전시실","윤중로","청계천","탄천","갤러리하우스","접수처","원무실","부장실","옥상정원"
					,"예배당","예배실","기도실","불당","사당","밭","런웨이","트랙","패션쇼장","피팅룸","신부대기실","꽃집","꽃가게","다리","노점","잠실대교","청담대교","굴다리","원효대교","올림픽대교"
					,"식물원","양화대교","잠수교","성수대교","천호대교","그랜드캐년","도봉산","청계산","면세점","멀티방","DVD룸","셋방","전세방","전셋집","정신과","레이싱장","롤러코스터","엑스포장","감독실"
					,"모터쇼장","갤러리","오피스텔","복권집","피라미드","홍대클럽거리","나이트클럽","동방","동아리방","가정법원","해외지사","분점","사무국","할인마트","공중전화박스","조선소","트레일러"
					,"자취방","N타워","가로수길","감옥","강변북로","강원랜드","갯벌","검찰청","경륜장","경마장","경주","경찰청","고시원","공동묘지","관악산","광장","교도소","교실","구멍가게","구청"
					,"국립묘지","군부대","군청","금강산","급식실","길가","까페","남산","남산타워","남이섬","남한산성","남해","내과","노천온천","녹음실","놀이방","농장","당구장","대나무숲","대법원","대청마루"
					,"댐","도박장","독립기념관","동강","동물원","동사무소","동해","둘레길","뒷간","뒷골목","등산로","뚜레주르","라디오부스","레드카펫 위","롤러장","롯데리아","롯데백화점","롯데호텔","마당"
					,"마루","마사지샵","만화방","맥도날드","면사무소","미술관","미술실","미장원","민속촌","밀림","박물관","발코니","백두산","버거킹","버스정류소","법원","보드게임방","보라매공원","부엌"
					,"북한산","불국사","뻘","사격장","사막","사장실","산소방","삼청동","샤워실","서래마을","서울대공원","서울성곽","서울숲","서재","서해안고속도로","설악산","세트장","소아과","속초","수면실"
					,"수목원","수퍼","숙박업소","스케이트장","스타벅스","스튜디오","시험장","신라호텔","신세계백화점","신혼여행지","실험실","아차산","아트센타","아트센터","안마방","야산","야영장","어린이집"
					,"억새풀밭","얼음방","에버랜드","연구소","연구실","연못","연회홀","열람실","염전","영안실","오토캠핑장","온천","올레길","올림픽대로","우체국","워커힐호텔","워터파크","유람선안","유원지"
					,"유아원","유치장","음악실","읍내","읍사무소","이빈후과","인사동","자동차극장","재래시장","저수지","전시관","전화방","정글","정선","정육점","정자","주문진","주민센타","주민센터","중앙공원"
					,"지구대","찜방","체육관","초원","촬영장","출구","치과","카지노","커피빈","톨게이트","투썸플레이스","캠프장","파리바게트","파티룸","페밀리레스토랑","펜션","편집실","폭포","피로연장"
					,"필드","하늘공원","피부과","하얏트호텔","하우스","한라산","한옥마을","한의원","해수욕장","해운대","호수","황토방","회의실","흡연실","강변","홍대입구","이대","이화여대","강남역"
					,"강변역","빌딩","계단","담벼락","북카페","일식집","중국집","직장","골목길","갓길","오두막","달동네","번화가","시내","야외","창가","입구","벤치","의자","경로당","노인정","오거리","이태원"
					,"먹자골목","역삼역","지하철역","신발장","냉장창고","방","제과점","빵집","문방구","미용실","헤어샵","헤어숍","피부관리실","기차역","서울역","버스정류장","본관","현관","현관문","재개발지역"
					,"구시가지","시가지","위성도시","카페테리아","신문사","로드샵","왕릉","태릉선수촌","육군사관학교","주식거래소","전통시장","대형마트","신도시","주상복합","단독주택","전당포","국도","육교"
					,"지하도","터널","조리실","실습실","고객센터","선술집","맥주전문점","카페거리","선거장","대박집","탐험장소","아마존","남극","북극","서핑장","실내스키장","암벽","과수원","체험장"
					,"공사장","공사판","대기소","코엑스","KTX","좌석버스","국회의사당","서울대","고려대","연세대","하천","정원","진흙탕","황토찜질방","출판사","잠수함","평원","지중해","한반도"
					,"유럽","서유럽","북유럽","대리점","바자회장","다락방","인공호수","인공폭포","포육실","작업실","보관소","사물함","콘도","식판집","중고서점","무대","밀실","객실","지정좌석","판문점"
					,"임진각","스쿨존","판매처","언론사","호텔뷔페","중환자실","식약청","청와대","비상구","비상계단","예식장","안과","국립중앙도서관","국립중앙박물관","국립민속박물관","비원"
					,"골프연습장","본사","신청사","여대","휴전선","DMZ","비무장지대","캡슐호텔","침실","손님방","연습장","여중","여고","남중","남고","수족관","중식집","심해","우주정거장"
					,"네일샵","틈새호텔","선거캠프","역전","터미널","쇼핑센터","서낭당","면허시험장","운전면허시험장","전통찻집","쪽방","단칸방","독도","관람차","대회장","연회실","예약석","예약실","식장"
					,"관청","탕비실","묘지","샐러드바","초소","보호소","입양센터","사원","문화센터","오페라하우스","대강당","소강당","객석","매표소","조수석","고물상","재활용센터","매대","카운터","살롱"
					,"양계장","처가댁","주유소","해군사관학교","공군사관학교","가정집","한옥","영화관","상가","고궁","휴양지","요양원","보건소","아시안게임","이틀","집","친구네","저녁때","친구집","평상시"
					,"하숙집","복날","욕실","출근준비때","눈뜨자마자","엘리베이터","출근시간","따스한봄날","장마","흐린날","운동할때","점심식사후","업무중","회의때","찜질방","해가뜨거운날","오후3시의티타임"
					,"점심","무더운여름날","한가할때","어스름할때","저녘","택시","바람부는날","지하철","태풍이왔을때","크루즈","정오","약국","자기전","일출","침대","일몰","야밤","눈오는날","더운날"
					,"추운날","우연","설연휴","추석연휴","주방","친정","외가","은행","현상소","호프집","안내소","취하다","응급실","오후","오전","정류장","호텔","여행지","야구장","축구장","운동장"
					,"선보는자리","여름","주차장","이른아침","이른오후","중학교","저녁","월요일","휴게실","휴게소","잠실운동장","장례식","장례식장","추석","일요일","횡단보도","어린이날","어버이날"
					,"옥상","스승의날","해변","휴일","며칠전","이마트","며칠후","주말","잔디밭","일상","제주도","음식점","해마다","클럽","월드컵","결승전","4강전","16강전","8강전","올림픽","개강날"
					,"개봉날","개봉일","개학","결제날","고혼식","공고날","과혼식","귀빠진날","금강혼식","호숫가","비행기사고","입원실","노는날","노을질때","놀토","택배상하차장","화물트럭","화장장","화산지대"
					,"책읽다","발표날","추첨일","개막일","예약일","내원일","발인일","채용일","이벤트데이","우기","제작일","데뷔날","폐문시간","오픈시간","자정","야자시간","자습시간","휴가","연휴"
					,"황금연휴","샌드위치휴일","운동회날","조선시대","출산일","여름철","초겨울","꽃놀이철","휴가철","월급입금일","모집기간","축제기간","풀타임","영업시간","지난주","옥탑방","전시실","윤중로","청계천"
					,"접수처","런웨이","트랙","전세방","전셋집","정신과","엑스포","피라미드","해외지사","할인마트","트레일러","자취방","도혼식","동혼식","마감일","마혼식","말복","맑은날","마감날","목혼식","무지개뜬날"
					,"불금","빼빼로데이","시험기간","야간","연말","연말연시","연초","요금납부일","월급날","월초","은혼식","입국날","정월대보름","제헌절","졸업하는날","종강날","중복","지혼식","진주혼식","첫날","초가을"
					,"초복","출국날","출시일","한겨울","합격발표날","헤어진날","혁혼식","홍옥혼식","화해한날","회갑잔치날","휴가기간","안마방","야산","야영장","억새풀밭","얼음방","온천","올레길","워커힐호텔"
					,"워터파크","유람선안","유원지","인사동","자동차극장","자동차안","재래시장","전철안","전화방","정글","정자역","주문진","주민센타","주민센터","지구대","찜방","체육관","촬영장","테이블위","톨게이트"
					,"피로연장","필드","하우스","해수욕장","호수","화투장","황토방","회의실","흡연실","이대","이화여대","일식집","중국집","직장","테이블","창가","이태원","지하철역","피부관리실","내방","김장철"
					,"철창","현관","현관문","구시가지","육군사관학교","현지시각","예정일","임용일","현재","과거","학기","월말","공백기","휴식기","안식년","중간고사기간","기말고사기간","근무중","예정시간"
					,"납부일","납부기간","유효기간","유통기간","공소시효","현재시간","평년","올해","현존","추후","무렵","훗날","아침나절","정각","시즌","하반기","만기일","저번주","주문일","말년","수확철","공강시간"
					,"자투리시간","회복기","대회기간","유치기간","유년기","말기","중반","후반","혹한기","혹서기","이른새벽","최초","제한시간","금년","첫눈오는날","이브날","신정","털갈이기간","불경기","전날"
					,"하루종일","평소","합의날짜","특별한날","접수시간","예약시간","예약날짜","계약기간","약속시간","약속날짜","20세기","21세기","100주년","50주년","1주년","10주년","업무시간","점심시간"
					,"계약일","제삿날","기일","이사철","만년","출국시간","연재날","연재기간","경기시간","노후","주식거래소","전통시장","주상복합","전당포","티켓링크","지하도","터널","조리실","해외","콜센터","화물선"
					,"좌석버스","정원","진흙탕","황토찜질방","출판사","태평양","포육실","중고서점","외부","내부","지정좌석","임진각","호텔뷔페","중환자실","휴전선","침실","중식집","틈새호텔","전통찻집","쪽방","예약석"
					,"텐트","입양센터","조수석","카운터","처가댁","주유소","운동부족","해군사관학교","휴양지","요양원","양치","머리감기","학교앞","학원앞","동네공원","엑스포","시청앞광장","KTX안"
					,"고속버스안","기차안","레드카펫위","자동차안","전철안","정자역","교정","고대","선물의집","바이칼호수","분실물보관소","스파샵","휘닉스파크","대명리조트","하이원리조트"
					,"곤지암리조트","출근준비때","씻기전","따스한봄날","비오는날","꽃피는봄","운동할때","점심식사후","회의때","나들이갈때","해가뜨거운날","오후3시의티타임","소풍가는날","한가할때"
					,"어스름할때","자기전","늦은저녁","이른아침","이른오후","부처님오신날","노을질때","시집가는날","무지개뜬날","싸운날","졸업하는날","크리스마스이브","중간고사기간","국군의날","이른새벽"
					,"첫눈오는날","독도의날","특별한날","성년의날","내방","화해한날","태풍이왔을때","아침식사때","노는날","눈뜨자마자","귀빠진날","성년의날","일몰시간","일출시간","중복날","휴가일"
					,"게임방","시내버스안","신호등앞","택시안","테이블아래","테이블위","텐트안","태권도장","검도장","유도장","만남의광장","이비인후과","이화여자대학교","전철역","지하철안"
					,"개찰구","플랫폼","책상앞","출판단지","화장터","용평리조트","무주리조트","리프트위","리프트위","강촌리조트","엘리시안","강촌","청평","가평","춘천","소양강","소양댐"
					,"청평댐","대성리","엠티촌","mt촌","구곡폭포","자라섬","허브마을","쁘띠프랑스","아침고요수목원","제이드가든","포천","피아노폭포","산사원","양조장","광릉수목원"
					,"국립휴양림","휴양림","국립수목원","헤이리","영어마을","프로방스","여주프리미엄아울렛","파주프리미엄아울렛","딸기가좋아","뽀로로테마파크","양평","양평역","두물머리"
					,"세미원","양평카페촌","카페촌","카페골목","양수리","팔당댐","팔당유원지","자연휴양림","용문사","청평사","수덕사","베어스타운","허브아일랜드","포천아트밸리","산정호수","스파펜션"
					,"대포항","담양","죽녹원","메타세콰이어길","소쇄원","온양온천","무등산","여수","하동","화개장터","화엄사","벚꽃길","벚꽃길","센텀시티","여수돌산대교","광주"
					,"광양","백운산","진해","쌍계사","우도","신도림","타임스퀘어","떡볶이골목","떡볶이골목","순대촌","내장산","부산","테디베어박물관","서귀포","꽃지","단양"
					,"안면도","대부도","오이도","영흥도","제부도","석모도","강화도","매화마을","산수유마을","섬진강","청매실농원","봉평","메밀꽃밭","흥정계곡","선운사"
					,"오동도","태안반도","잠실구장","문학구장","무등경기장","사직구장","한밭구장","목동구장","아이스링크","종합운동장","충무로","전주","선착장","대사관","롯데마트"
					,"영풍문고","주차타워","공용주차장","목동","오목교","제천","원주","대관령","양떼목장","동성로","성형수술","수비","보딩","안과진료","오늘","로스트밸리"
					,"캐리비안베이","오션월드","사파리","돌곶이역","성수역","마포대교","영화시사회","100주년","첫인상","마지막","처음","컴플렉스","콤플렉스","삼성역","잠실역"
					
					// 긴급
					,"KIA", "기아", "기아차", "기아자동차", "모닝", "올 뉴 모닝", "모닝 바이퓨얼", "기아 모닝", "프라이드", "프라이드 세단", "프라이드 해치백", "K3", "K3쿱", "K3 해치백", "K3 디젤", "K5", "더 뉴 K5", "K5 터보", "K5 하이브리드", "K7", "더 뉴K7", "프레스티지 K7", "K7 하이브리드", "K9", "프레스티지 K9", "레이", "기아 레이", "기아 레이 EV", "기아 레이 밴", "레이 밴", "레이 EV", "쏘울", "쏘울 GDI", "뉴 쏘울", "올 뉴 쏘울 ", "카렌스", "올 뉴 카렌스", "카렌스 LPG", "뉴 카렌스", "스포티지", "스포티지R", "뉴 스포티지R ", "쏘렌토", "쏘렌토R", "뉴 쏘렌토R ", "모하비", "카니발", "카니발R", "그랜드 카니발", "그랜드 카니발R", "카니발 하이리무진", "카니발 이지무브", "카니발  YP", "올 뉴 카니발"
					
					
			};
			
			
			for(String keyword : keywords){
				keywordList.add( keyword );
			}
		}
		
		return keywordList;
	}
	
}
