package com.tapacross.sns.crawler.daum.cafe.util;

import com.esmedia.log.LoggerWrapper;

public class ContentFilter {
	/**
	 * 
	 * @param content
	 * @param title
	 * @return
	 */
	public static boolean filterKeyword( String content, String title ){
		//"주식시황","주식투자","증권","증시"
		String[] keywords = {"바카라", "폰섹", "카지노","게이","경마","경마사이트","경매","계약동거","관음","남성전용","남자꼬시기","노출팬티"
				,"대딸방","대화방","던전앤파이터","덴프로","도리짓고땡","라이브배팅","룸살","릴게임","마작","모텔비","무료성인","무료성인동영상","바다이야기"
				,"바바라","바카라","바카라꽁","바카라사이트","법원경매","베트맨배팅","베팅사이트","변태","보증","분양","블랙잭","블랙잭룰","사설배팅","사설스포츠"
				,"사이트바카라","생중계바카라","생중계카지노","섯다","성인동영상","성인만보는카페","성인자료실","성인전용카페","성인화상"
				,"성인화상채팅","섹스","섹시","스포츠배팅","스포츠토토","슴살","신음소리","아비아바둑이","안마","애인대","애인대행","야마토","야한동영상"
				,"엉덩이","오션파라다이스","옷벗은","와와","와이즈배팅","성인", "원룸","원정성매매","이쁜이수술","입사질사","자위","자위기구","잭블랙","잭팟"
				,"전화방","젖가슴","창녀","추천주","출장마사지","출장안마","카드게임","카섹","카지노","카지노룰렛","카지노사이트"
				,"코인","콘돔자위","타짜","토렌트","퇴행성","파트너","팬티","포커","폰타나바둑이","폰팅","하나님의말씀","호모","화상채팅","화상캠","카?지노","카지.노","바카.라"
				,"배팅사이트","섹/스","섹/스/파/트/너","출장만남","경.마","라이브 스코어","비아그라","바카라","카지노","경..마","파치","립카페","노리터"
				,"묻지마관광","텐프로아가씨","풀살롱","성매매","알몸공개","야마토2게임","야마토연타기능","82HOT . COM","16core . net","d h 96 . net","82yES . CoM","82TOP . COM"
				,"D E C 5 0 0 . C O M","G I B 6 8 5 . C","http://pro1.nxe8.com","성인오락","무 ○료 마 사 ○지","출장.만남","ＣＬＵＢ５６８．ＣＯＭ","오피스텔걸","오피걸"
		};
		for( String keyword : keywords ){
			if(content.indexOf(keyword) >= 0 || title.indexOf(keyword) >= 0){
				return false;
			}
		}
		return true;
	}
	
	public static boolean filterKeyword( String content){
		//"주식시황","주식투자","증권","증시"
		String[] keywords = {"바카라", "폰섹", "카지노","게이","경마","경마사이트","경매","계약동거","관음","남성전용","남자꼬시기","노출팬티"
				,"대딸방","대화방","던전앤파이터","덴프로","도리짓고땡","라이브배팅","룸살","릴게임","마작","모텔비","무료성인","무료성인동영상","바다이야기"
				,"바바라","바카라","바카라꽁","바카라사이트","법원경매","베트맨배팅","베팅사이트","변태","보증","분양","블랙잭","블랙잭룰","사설배팅","사설스포츠"
				,"사이트바카라","생중계바카라","생중계카지노","섯다","성인동영상","성인만보는카페","성인자료실","성인전용카페","성인화상"
				,"성인화상채팅","섹스","섹시","스포츠배팅","스포츠토토","슴살","신음소리","아비아바둑이","안마","애인대","애인대행","야마토","야한동영상"
				,"엉덩이","오션파라다이스","옷벗은","와와","와이즈배팅","원룸","원정성매매","이쁜이수술","입사질사","자위","자위기구","잭블랙","잭팟"
				,"전화방","젖가슴","창녀","추천주","출장마사지","출장안마","카드게임","카섹","카지노","카지노룰렛","카지노사이트"
				,"코인","콘돔자위","타짜","토렌트","퇴행성","파트너","팬티","포커","폰타나바둑이","폰팅","호모","화상채팅","화상캠","카?지노","카지.노","바카.라"
				,"배팅사이트","섹/스","섹/스/파/트/너","출장만남","경.마","라이브 스코어","비아그라","바카라","카지노","경..마","파치","립카페","노리터"
				,"묻지마관광","텐프로아가씨","풀살롱","성매매","알몸공개","야마토2게임","야마토연타기능","82HOT . COM","16core . net","d h 96 . net","82yES . CoM","82TOP . COM"
				,"D E C 5 0 0 . C O M","G I B 6 8 5 . C","http://pro1.nxe8.com","성인오락","무 ○료 마 사 ○지","출장.만남","ＣＬＵＢ５６８．ＣＯＭ","오피스텔걸","오피걸"
				,"온라인바다이야기","황금성다운로드","황금성게임","무료릴게임","릴게임신천지","인터넷릴게임","성인오락", "풀사롱", "풀싸롱", "매직미러", "대떡방"
		};
		for( String keyword : keywords ){
			if(content.indexOf(keyword) >= 0){
				return false;
			}
		}
		return true;
	}
}
